lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
#pragma once

#include <stddef.h>
#include <stdint.h>

#include "nrf54l15_regs.h"
#include "xiao_nrf54l15_pins.h"

extern "C" void nrf54l15_clean_ble_idle_service(void);
extern "C" void nrf54l15_clean_ble_yield_service(void);
extern "C" uint32_t nrf54l15_clean_ble_idle_sleep_cap_us(void);

namespace xiao_nrf54l15 {

extern "C" void nrf54l15_ble_idle_service(void);
extern "C" void nrf54l15_ble_grtc_irq_service(void);
extern "C" void nrf54l15_ble_clock_irq_service(void);
extern "C" void nrf54l15_grtc_pwm_irq_service(void);
extern "C" uint32_t nrf54l15_ble_grtc_reserved_cc_mask(void);
extern "C" void PendSV_Handler(void);

uint64_t hardwareUniqueId64();
uint64_t zigbeeFactoryEui64();

enum class CpuFrequency : uint32_t {
  k64MHz = 64000000UL,
  k128MHz = 128000000UL,
};

enum class GpioDirection : uint8_t {
  kInput = 0,
  kOutput = 1,
};

enum class GpioPull : uint8_t {
  kDisabled = 0,
  kPullDown = 1,
  kPullUp = 3,
};

class ClockControl {
 public:
  static bool startHfxo(bool waitForTuned = true, uint32_t spinLimit = 1000000UL);
  static void stopHfxo();
  static bool setCpuFrequency(CpuFrequency frequency);
  static CpuFrequency cpuFrequency();
  static bool enableIdleCpuScaling(CpuFrequency idleFrequency = CpuFrequency::k64MHz);
  static void disableIdleCpuScaling();
  static bool idleCpuScalingEnabled();
  static CpuFrequency idleCpuFrequency();
};

class Gpio {
 public:
  static bool configure(const Pin& pin, GpioDirection direction,
                        GpioPull pull = GpioPull::kDisabled);
  static bool write(const Pin& pin, bool high);
  static bool read(const Pin& pin, bool* high);
  static bool toggle(const Pin& pin);

  // Configure GPIO drive as S0D1 (open-drain style) for TWIM lines.
  static bool setDriveS0D1(const Pin& pin);
};

enum class SpiMode : uint8_t {
  kMode0 = 0,
  kMode1 = 1,
  kMode2 = 2,
  kMode3 = 3,
};

class Spim {
 public:
  explicit Spim(uint32_t base = nrf54l15::SPIM21_BASE,
                uint32_t coreClockHz = 128000000UL);

  bool begin(const Pin& sck, const Pin& mosi, const Pin& miso,
             const Pin& cs = kPinDisconnected, uint32_t hz = 4000000UL,
             SpiMode mode = SpiMode::kMode0, bool lsbFirst = false);
  bool setFrequency(uint32_t hz);
  void end();

  bool transfer(const uint8_t* tx, uint8_t* rx, size_t len,
                uint32_t spinLimit = 2000000UL);

 private:
  uint32_t base_;
  uint32_t coreClockHz_;
  Pin cs_;
};

class Spis {
 public:
  explicit Spis(uint32_t base = nrf54l15::SPIS00_BASE);

  bool begin(const Pin& sck, const Pin& mosi, const Pin& miso, const Pin& csn,
             SpiMode mode = SpiMode::kMode0, bool lsbFirst = false,
             uint8_t defaultChar = 0xFFU, uint8_t overReadChar = 0x00U,
             bool autoAcquireAfterEnd = true);
  bool acquire(uint32_t spinLimit = 200000UL);
  bool setBuffers(uint8_t* rx, size_t rxLen, const uint8_t* tx, size_t txLen,
                  uint32_t spinLimit = 200000UL);
  bool releaseTransaction();
  bool pollAcquired(bool clearEvent = true);
  bool pollEnd(bool clearEvent = true);
  size_t receivedBytes() const;
  size_t transmittedBytes() const;
  bool overflowed() const;
  bool overread() const;
  void clearStatus();
  void end();

 private:
  NRF_SPIS_Type* spis_;
  bool active_;
};

enum class TwimFrequency : uint32_t {
  k100k = nrf54l15::twim::FREQUENCY_100K,
  k250k = nrf54l15::twim::FREQUENCY_250K,
  k400k = nrf54l15::twim::FREQUENCY_400K,
  k1000k = nrf54l15::twim::FREQUENCY_1000K,
};

class Twim {
 public:
  explicit Twim(uint32_t base = nrf54l15::TWIM21_BASE);

  bool begin(const Pin& scl, const Pin& sda,
             TwimFrequency frequency = TwimFrequency::k400k);
  bool setFrequency(TwimFrequency frequency);
  void end();

  bool write(uint8_t address7, const uint8_t* data, size_t len,
             uint32_t spinLimit = 2000000UL);
  bool read(uint8_t address7, uint8_t* data, size_t len,
            uint32_t spinLimit = 2000000UL);
  bool writeRead(uint8_t address7, const uint8_t* tx, size_t txLen,
                 uint8_t* rx, size_t rxLen, uint32_t spinLimit = 2000000UL);

 private:
  uint32_t base_;
};

enum class UarteBaud : uint32_t {
  k9600 = nrf54l15::uarte::BAUD_9600,
  k115200 = nrf54l15::uarte::BAUD_115200,
  k1000000 = nrf54l15::uarte::BAUD_1M,
};

class Uarte {
 public:
  explicit Uarte(uint32_t base = nrf54l15::UARTE21_BASE);

  bool begin(const Pin& txd, const Pin& rxd,
             UarteBaud baud = UarteBaud::k115200,
             bool hwFlowControl = false,
             const Pin& cts = kPinDisconnected,
             const Pin& rts = kPinDisconnected);
  void end();

  bool write(const uint8_t* data, size_t len, uint32_t spinLimit = 2000000UL);
  size_t read(uint8_t* data, size_t len, uint32_t spinLimit = 2000000UL);

 private:
  uint32_t base_;
};

enum class TimerBitWidth : uint8_t {
  k16bit = nrf54l15::timer::BITMODE_16,
  k8bit = nrf54l15::timer::BITMODE_8,
  k24bit = nrf54l15::timer::BITMODE_24,
  k32bit = nrf54l15::timer::BITMODE_32,
};

class Timer {
 public:
  using CompareCallback = void (*)(uint8_t channel, void* context);

  explicit Timer(uint32_t base = nrf54l15::TIMER20_BASE,
                 uint32_t pclkHz = 16000000UL,
                 uint8_t channelCount = 6);

  bool begin(TimerBitWidth bitWidth = TimerBitWidth::k32bit,
             uint8_t prescaler = 4,
             bool counterMode = false);
  bool setFrequency(uint32_t targetHz);
  uint32_t timerHz() const;
  uint32_t ticksFromMicros(uint32_t us) const;

  void start();
  void stop();
  void clear();

  bool setCompare(uint8_t channel, uint32_t ccValue,
                  bool autoClear = false,
                  bool autoStop = false,
                  bool oneShot = false,
                  bool enableInterrupt = false);
  uint32_t capture(uint8_t channel);
  uint32_t ccValue(uint8_t channel) const;
  bool pollCompare(uint8_t channel, bool clearEvent = true);
  volatile uint32_t* publishCompareConfigRegister(uint8_t channel) const;
  volatile uint32_t* subscribeStartConfigRegister() const;
  volatile uint32_t* subscribeStopConfigRegister() const;
  volatile uint32_t* subscribeCountConfigRegister() const;
  volatile uint32_t* subscribeClearConfigRegister() const;
  volatile uint32_t* subscribeCaptureConfigRegister(uint8_t channel) const;

  void enableInterrupt(uint8_t channel, bool enable = true);
  bool attachCompareCallback(uint8_t channel, CompareCallback callback,
                             void* context = nullptr);
  void service();

