lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
 private:
  uint32_t base_;
  uint32_t pclkHz_;
  uint8_t channelCount_;
  uint8_t prescaler_;
  CompareCallback callbacks_[8];
  void* callbackContext_[8];
};

class Pwm {
 public:
  enum IrqEvent : uint32_t {
    kIrqStopped = (1UL << 1U),
    kIrqSequenceStarted0 = (1UL << 2U),
    kIrqSequenceStarted1 = (1UL << 3U),
    kIrqSequenceEnd0 = (1UL << 4U),
    kIrqSequenceEnd1 = (1UL << 5U),
    kIrqPeriodEnd = (1UL << 6U),
    kIrqLoopsDone = (1UL << 7U),
    kIrqRamUnderflow = (1UL << 8U),
    kIrqDmaSequenceEnd0 = (1UL << 9U),
    kIrqDmaSequenceReady0 = (1UL << 10U),
    kIrqDmaSequenceBusError0 = (1UL << 11U),
    kIrqDmaSequenceEnd1 = (1UL << 12U),
    kIrqDmaSequenceReady1 = (1UL << 13U),
    kIrqDmaSequenceBusError1 = (1UL << 14U),
    kIrqCompareMatch0 = (1UL << 15U),
    kIrqCompareMatch1 = (1UL << 16U),
    kIrqCompareMatch2 = (1UL << 17U),
    kIrqCompareMatch3 = (1UL << 18U),
  };

  enum class DecoderLoad : uint8_t {
    kCommon = nrf54l15::pwm::DECODER_LOAD_COMMON,
    kGrouped = nrf54l15::pwm::DECODER_LOAD_GROUPED,
    kIndividual = nrf54l15::pwm::DECODER_LOAD_INDIVIDUAL,
    kWaveForm = nrf54l15::pwm::DECODER_LOAD_WAVEFORM,
  };

  enum class DecoderMode : uint8_t {
    kRefreshCount = nrf54l15::pwm::DECODER_MODE_REFRESHCOUNT,
    kNextStep = nrf54l15::pwm::DECODER_MODE_NEXTSTEP,
  };

  enum class CounterMode : uint8_t {
    kUp = nrf54l15::pwm::MODE_UP,
    kUpDown = nrf54l15::pwm::MODE_UPDOWN,
  };

  struct ChannelConfig {
    Pin outPin;
    uint16_t dutyPermille;
    bool activeHigh;
  };

  using IrqCallback = void (*)(uint32_t irqMask, void* context);

  explicit Pwm(uint32_t base = nrf54l15::PWM20_BASE);
  static constexpr uint8_t maxChannelCount() { return 4U; }
  static uint16_t clampCountertop(uint16_t countertop);
  static uint16_t encodeSequenceWordTicks(uint16_t pulseTicks,
                                          bool activeHigh = true);
  static uint16_t encodeSequenceWordPermille(uint16_t dutyPermille,
                                             uint16_t countertop,
                                             bool activeHigh = true);
  static constexpr uint32_t irqSequenceStartedMask(uint8_t sequence) {
    return (sequence < 2U) ? (1UL << (2U + sequence)) : 0U;
  }
  static constexpr uint32_t irqSequenceEndMask(uint8_t sequence) {
    return (sequence < 2U) ? (1UL << (4U + sequence)) : 0U;
  }
  static constexpr uint32_t irqDmaSequenceEndMask(uint8_t sequence) {
    return (sequence < 2U) ? (1UL << (9U + (sequence * 3U))) : 0U;
  }
  static constexpr uint32_t irqDmaSequenceReadyMask(uint8_t sequence) {
    return (sequence < 2U) ? (1UL << (10U + (sequence * 3U))) : 0U;
  }
  static constexpr uint32_t irqDmaSequenceBusErrorMask(uint8_t sequence) {
    return (sequence < 2U) ? (1UL << (11U + (sequence * 3U))) : 0U;
  }
  static constexpr uint32_t irqCompareMatchMask(uint8_t channel) {
    return (channel < maxChannelCount()) ? (1UL << (15U + channel)) : 0U;
  }
  static constexpr uint32_t irqSupportedMask() {
    return kIrqStopped | kIrqSequenceStarted0 | kIrqSequenceStarted1 |
           kIrqSequenceEnd0 | kIrqSequenceEnd1 | kIrqPeriodEnd |
           kIrqLoopsDone | kIrqRamUnderflow | kIrqDmaSequenceEnd0 |
           kIrqDmaSequenceReady0 | kIrqDmaSequenceBusError0 |
           kIrqDmaSequenceEnd1 | kIrqDmaSequenceReady1 |
           kIrqDmaSequenceBusError1 | kIrqCompareMatch0 |
           kIrqCompareMatch1 | kIrqCompareMatch2 | kIrqCompareMatch3;
  }

  bool beginChannels(const ChannelConfig* channels, uint8_t channelCount,
                     uint32_t frequencyHz = 1000UL);
  bool beginRaw(const Pin* outPins, uint8_t channelCount,
                uint32_t frequencyHz = 1000UL,
                DecoderLoad load = DecoderLoad::kIndividual,
                DecoderMode mode = DecoderMode::kRefreshCount,
                uint8_t idleOutMask = 0U,
                CounterMode counterMode = CounterMode::kUp);

  bool beginSingle(const Pin& outPin,
                   uint32_t frequencyHz = 1000UL,
                   uint16_t dutyPermille = 500,
                   bool activeHigh = true);
  bool setDutyPermille(uint16_t dutyPermille);
  bool setDutyPermille(uint8_t channel, uint16_t dutyPermille);
  bool setActiveHigh(uint8_t channel, bool activeHigh);
  bool setSequence(uint8_t sequence, const uint16_t* words, uint16_t wordCount,
                   uint32_t refreshCount = 0U, uint32_t endDelay = 0U);
  bool setLoopCount(uint16_t loopCount);
  bool setCounterMode(CounterMode mode);
  bool setFrequency(uint32_t frequencyHz);
  bool triggerNextStep();
  bool channelConfigured(uint8_t channel) const;
  uint8_t configuredChannelMask() const;
  uint16_t countertop() const;
  uint8_t prescaler() const;
  DecoderLoad decoderLoad() const;
  DecoderMode decoderMode() const;
  CounterMode counterMode() const;
  volatile uint32_t* publishStoppedConfigRegister() const;
  volatile uint32_t* publishSequenceStartedConfigRegister(uint8_t sequence) const;
  volatile uint32_t* publishSequenceEndConfigRegister(uint8_t sequence) const;
  volatile uint32_t* publishPeriodEndConfigRegister() const;
  volatile uint32_t* publishLoopsDoneConfigRegister() const;
  volatile uint32_t* publishRamUnderflowConfigRegister() const;
  volatile uint32_t* publishCompareMatchConfigRegister(uint8_t channel) const;
  volatile uint32_t* subscribeStopConfigRegister() const;
  volatile uint32_t* subscribeNextStepConfigRegister() const;
  volatile uint32_t* subscribeSequenceStartConfigRegister(uint8_t sequence) const;
  uint32_t pendingInterruptMask() const;
  void clearInterruptEvents(uint32_t mask);
  void enableInterruptMask(uint32_t mask, bool enable = true);
  void setIrqCallback(IrqCallback callback, void* context = nullptr);
  bool makeActive(uint8_t irqPriority = 3U);
  void onIrq();

  bool start(uint8_t sequence = 0, uint32_t spinLimit = 2000000UL);
  bool stop(uint32_t spinLimit = 2000000UL);
  void end();

  bool pollPeriodEnd(bool clearEvent = true);
  bool pollCompareMatch(uint8_t channel, bool clearEvent = true);
  bool pollSequenceStarted(uint8_t sequence, bool clearEvent = true);
  bool pollSequenceEnd(uint8_t sequence, bool clearEvent = true);
  bool pollDmaSequenceEnd(uint8_t sequence, bool clearEvent = true);
  bool pollDmaSequenceReady(uint8_t sequence, bool clearEvent = true);
  bool pollDmaSequenceBusError(uint8_t sequence, bool clearEvent = true);
  bool pollLoopsDone(bool clearEvent = true);
  bool pollRamUnderflow(bool clearEvent = true);
  uint32_t sequenceConfiguredBytes(uint8_t sequence) const;
  uint32_t sequenceTransferredBytes(uint8_t sequence) const;
  uint32_t sequenceCurrentTransferredBytes(uint8_t sequence) const;
  uint32_t sequenceBusErrorAddress(uint8_t sequence) const;

