lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
 private:
  bool applyOutputRouting(const Pin* outPins, uint8_t channelCount,
                         uint8_t idleOutMask);
  bool configureClockAndTop(uint32_t frequencyHz);
  void disconnectAllOutputs();
  void updateSequenceWords();

  uint32_t base_;
  Pin outPins_[4];
  uint16_t dutyPermille_[4];
  uint8_t configuredMask_;
  uint8_t activeHighMask_;
  uint16_t countertop_;
  uint8_t prescaler_;
  uint8_t sequenceConfiguredMask_;
  DecoderLoad loadMode_;
  DecoderMode mode_;
  CounterMode counterMode_;
  bool highLevelManaged_;
  bool configured_;
  IrqCallback irqCallback_;
  void* irqContext_;
  alignas(4) uint16_t sequence_[4];
};

enum class GpiotePolarity : uint8_t {
  kNone = nrf54l15::gpiote::POLARITY_NONE,
  kLoToHi = nrf54l15::gpiote::POLARITY_LOTOHI,
  kHiToLo = nrf54l15::gpiote::POLARITY_HITOLO,
  kToggle = nrf54l15::gpiote::POLARITY_TOGGLE,
};

class Gpiote {
 public:
  using InCallback = void (*)(uint8_t channel, void* context);

  explicit Gpiote(uint32_t base = nrf54l15::GPIOTE20_BASE,
                  uint8_t channelCount = 8);

  bool configureEvent(uint8_t channel, const Pin& pin, GpiotePolarity polarity,
                      bool enableInterrupt = false);
  bool configureTask(uint8_t channel, const Pin& pin, GpiotePolarity polarity,
                     bool initialHigh = false);
  void disableChannel(uint8_t channel);

  bool triggerTaskOut(uint8_t channel);
  bool triggerTaskSet(uint8_t channel);
  bool triggerTaskClr(uint8_t channel);

  bool pollInEvent(uint8_t channel, bool clearEvent = true);
  bool pollPortEvent(bool clearEvent = true);
  volatile uint32_t* subscribeTaskOutConfigRegister(uint8_t channel) const;
  volatile uint32_t* subscribeTaskSetConfigRegister(uint8_t channel) const;
  volatile uint32_t* subscribeTaskClrConfigRegister(uint8_t channel) const;

  void enableInterrupt(uint8_t channel, bool enable = true);
  bool attachInCallback(uint8_t channel, InCallback callback,
                        void* context = nullptr);
  void service();

 private:
  uint32_t base_;
  uint8_t channelCount_;
  InCallback callbacks_[8];
  void* callbackContext_[8];
};

class Dppic {
 public:
  explicit Dppic(uint32_t base = nrf54l15::DPPIC20_BASE);

  bool enableChannel(uint8_t channel, bool enable = true);
  bool channelEnabled(uint8_t channel) const;
  bool configureChannelGroup(uint8_t group, uint32_t channelMask) const;
  bool configurePublish(volatile uint32_t* publishRegister,
                        uint8_t channel,
                        bool enable = true) const;
  bool configureSubscribe(volatile uint32_t* subscribeRegister,
                          uint8_t channel,
                          bool enable = true) const;
  bool connect(volatile uint32_t* publishRegister,
               volatile uint32_t* subscribeRegister,
               uint8_t channel,
               bool enableChannel = true) const;
  bool disconnectPublish(volatile uint32_t* publishRegister) const;
  bool disconnectSubscribe(volatile uint32_t* subscribeRegister) const;

 private:
  NRF_DPPIC_Type* dppic_;
};

class Egu {
 public:
  explicit Egu(uint32_t base = nrf54l15::EGU20_BASE,
               uint8_t channelCount = 16);

  bool trigger(uint8_t channel);
  bool pollTriggered(uint8_t channel, bool clearEvent = true);
  void clearEvent(uint8_t channel);
  void clearAllEvents();
  void enableInterrupt(uint8_t channel, bool enable = true);
  bool configurePublish(uint8_t channel, uint8_t dppiChannel,
                        bool enable = true);
  bool configureSubscribe(uint8_t channel, uint8_t dppiChannel,
                          bool enable = true);
  volatile uint32_t* publishTriggeredConfigRegister(uint8_t channel) const;
  volatile uint32_t* subscribeTriggerConfigRegister(uint8_t channel) const;

 private:
  NRF_EGU_Type* egu_;
  uint8_t channelCount_;
};

class CracenRng {
 public:
  explicit CracenRng(uint32_t controlBase = nrf54l15::CRACEN_BASE,
                     uint32_t coreBase = nrf54l15::CRACENCORE_BASE);

  bool begin(uint32_t spinLimit = 400000UL);
  bool beginNonBlocking();
  void end();
  bool fill(void* data, size_t length, uint32_t spinLimit = 400000UL);
  bool randomWord(uint32_t* outWord, uint32_t spinLimit = 400000UL);
  bool tryRandomWord(uint32_t* outWord);
  uint32_t availableWords() const;
  uint32_t status() const;
  bool healthy() const;
  bool active() const;
  void clearEvent();

 private:
  bool ensureDataAvailable(uint32_t spinLimit);

  NRF_CRACEN_Type* cracen_;
  NRF_CRACENCORE_Type* core_;
  bool active_;
};

enum class KmuRevocationPolicy : uint32_t {
  kReserved = 0U,
  kRotating = 1U,
  kLocked = 2U,
  kRevoked = 3U,
};

struct alignas(16) KmuProvisionSource {
  uint32_t value[4];
  uint32_t revocationPolicy;
  uint32_t destination;
  uint32_t metadata;
};

class Kmu {
 public:
  explicit Kmu(uint32_t base = nrf54l15::KMU_BASE,
               uint32_t rramcBase = nrf54l15::RRAMC_BASE);

  bool ready() const;
  void clearEvents();
  bool pollProvisioned(bool clearEvent = true);
  bool pollPushed(bool clearEvent = true);
  bool pollRevoked(bool clearEvent = true);
  bool pollMetadataRead(bool clearEvent = true);
  bool pollPushBlocked(bool clearEvent = true);
  bool pollError(bool clearEvent = true);
  bool readMetadata(uint8_t slot, uint32_t* metadata,
                    uint32_t spinLimit = 600000UL);
  bool provision(uint8_t slot, const KmuProvisionSource& source,
                 uint32_t spinLimit = 600000UL);
  bool push(uint8_t slot, uint32_t spinLimit = 600000UL);
  bool revoke(uint8_t slot, uint32_t spinLimit = 600000UL);
  bool pushBlock(uint8_t slot, uint32_t spinLimit = 600000UL);

 private:
  bool waitReady(uint32_t spinLimit) const;
  bool performSimpleTask(uint8_t slot,
                         volatile uint32_t& task,
                         volatile uint32_t& successEvent,
                         uint32_t spinLimit);
  bool enableRramWrite(uint32_t* previousConfig, uint32_t spinLimit) const;
  void restoreRramWrite(uint32_t previousConfig, uint32_t spinLimit) const;

  NRF_KMU_Type* kmu_;
  NRF_RRAMC_Type* rramc_;
};

class CracenIkg {
 public:
  explicit CracenIkg(uint32_t controlBase = nrf54l15::CRACEN_BASE,
                     uint32_t coreBase = nrf54l15::CRACENCORE_BASE);

  bool begin(uint32_t spinLimit = 600000UL);
  void end();
  bool active() const;
  void clearEvent();

