lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
  uint32_t status() const;
  uint32_t pkeStatus() const;
  uint32_t hwConfig() const;
  uint8_t symmetricKeyCapacity() const;
  uint8_t privateKeyCapacity() const;

  bool okay() const;
  bool seedError() const;
  bool entropyError() const;
  bool catastrophicError() const;
  bool ctrDrbgBusy() const;
  bool symmetricKeysStored() const;
  bool privateKeysStored() const;

  bool markSeedValid(bool valid = true);
  bool lockSeed();
  bool lockProtectedRam();
  bool softResetKeys(uint32_t spinLimit = 600000UL);
  bool initInput();
  bool writeNonce(const uint32_t* words, size_t wordCount);
  bool writePersonalization(const uint32_t* words, size_t wordCount);
  bool setReseedInterval(uint64_t interval);
  bool start(uint32_t spinLimit = 600000UL);

 private:
  bool waitReady(uint32_t spinLimit) const;
  bool waitGenerationComplete(uint32_t spinLimit) const;

  NRF_CRACEN_Type* cracen_;
  NRF_CRACENCORE_Type* core_;
  bool active_;
};

class Tampc {
 public:
  explicit Tampc(uint32_t base = nrf54l15::TAMPC_BASE);

  uint32_t status() const;
  bool tamperDetected() const;
  bool writeErrorDetected() const;
  bool pollTamper(bool clearEvent = true);
  bool pollWriteError(bool clearEvent = true);
  void clearEvents();
  void enableInterrupts(bool tamper, bool writeError);
  bool pendingTamperInterrupt() const;
  bool pendingWriteErrorInterrupt() const;
  bool setInternalResetOnTamper(bool enable, bool lock = false);
  bool setExternalResetOnTamper(bool enable, bool lock = false);
  bool setEraseProtect(bool enable, bool lock = false);
  bool setCracenTamperMonitor(bool enable, bool lock = false);
  bool setActiveShieldMonitor(bool enable, bool lock = false);
  bool setGlitchSlowMonitor(bool enable, bool lock = false);
  bool setGlitchFastMonitor(bool enable, bool lock = false);
  bool setActiveShieldChannelMask(uint8_t channelMask);
  uint8_t activeShieldChannelMask() const;
  bool activeShieldChannelEnabled(uint8_t channel) const;
  bool setActiveShieldChannelEnabled(uint8_t channel, bool enable = true);

  bool internalResetOnTamperEnabled() const;
  bool externalResetOnTamperEnabled() const;
  bool eraseProtectEnabled() const;
  bool cracenTamperMonitorEnabled() const;
  bool activeShieldMonitorEnabled() const;
  bool glitchSlowMonitorEnabled() const;
  bool glitchFastMonitorEnabled() const;

  bool domainDbgenEnabled(uint8_t domain = 0U) const;
  bool domainNidenEnabled(uint8_t domain = 0U) const;
  bool domainSpidenEnabled(uint8_t domain = 0U) const;
  bool domainSpnidenEnabled(uint8_t domain = 0U) const;
  bool apDbgenEnabled(uint8_t ap = 0U) const;

  bool setDomainDbgen(bool enable, bool lock = false, uint8_t domain = 0U);
  bool setDomainNiden(bool enable, bool lock = false, uint8_t domain = 0U);
  bool setDomainSpiden(bool enable, bool lock = false, uint8_t domain = 0U);
  bool setDomainSpniden(bool enable, bool lock = false, uint8_t domain = 0U);
  bool setApDbgen(bool enable, bool lock = false, uint8_t ap = 0U);

  bool protectStatusError() const;
  bool cracenTamperStatusError() const;
  bool activeShieldStatusError() const;
  bool glitchSlowStatusError() const;
  bool glitchFastStatusError() const;
  bool intResetStatusError() const;
  bool extResetStatusError() const;
  bool eraseProtectStatusError() const;
  bool domainDbgenStatusError(uint8_t domain = 0U) const;
  bool domainNidenStatusError(uint8_t domain = 0U) const;
  bool domainSpidenStatusError(uint8_t domain = 0U) const;
  bool domainSpnidenStatusError(uint8_t domain = 0U) const;
  bool apDbgenStatusError(uint8_t ap = 0U) const;

 private:
  bool writeProtectedControl(volatile uint32_t& ctrlRegister,
                             uint32_t valueHigh,
                             uint32_t valueLow,
                             bool enable,
                             bool lock);
  bool protectedSignalEnabled(const volatile uint32_t& ctrlRegister) const;
  bool protectedStatusError(const volatile uint32_t& statusRegister) const;
  bool validDomainIndex(uint8_t domain) const;
  bool validApIndex(uint8_t ap) const;

  NRF_TAMPC_Type* tampc_;
};

class Aar {
 public:
  explicit Aar(uint32_t base = nrf54l15::AAR00_BASE);

  bool resolveFirst(const uint8_t address[6],
                    const uint8_t* irks,
                    size_t irkCount,
                    bool* outResolved,
                    uint16_t* outIndex = nullptr,
                    uint32_t spinLimit = 200000UL);
  bool resolveSingle(const uint8_t address[6],
                     const uint8_t irk[16],
                     bool* outResolved,
                     uint32_t spinLimit = 200000UL);
  uint32_t errorStatus() const;
  uint32_t resolvedAmountBytes() const;
  void clearEvents();

 private:
  NRF_AAR_Type* aar_;
};

class Ecb {
 public:
  explicit Ecb(uint32_t base = nrf54l15::ECB00_BASE);

  bool encryptBlock(const uint8_t key[16],
                    const uint8_t plaintext[16],
                    uint8_t ciphertext[16],
                    uint32_t spinLimit = 200000UL);
  bool encryptBlockInPlace(const uint8_t key[16],
                           uint8_t block[16],
                           uint32_t spinLimit = 200000UL);
  uint32_t errorStatus() const;
  void clearEvents();

 private:
  NRF_ECB_Type* ecb_;
};

enum class CcmBleDataRate : uint8_t {
  k125Kbit = CCM_MODE_DATARATE_125Kbit,
  k250Kbit = CCM_MODE_DATARATE_250Kbit,
  k500Kbit = CCM_MODE_DATARATE_500Kbit,
  k1Mbit = CCM_MODE_DATARATE_1Mbit,
  k2Mbit = CCM_MODE_DATARATE_2Mbit,
  k4Mbit = CCM_MODE_DATARATE_4Mbit,
};

class Ccm {
 public:
  explicit Ccm(uint32_t base = nrf54l15::CCM00_BASE);

  bool encryptBlePacket(const uint8_t key[16],
                        const uint8_t iv[8],
                        uint64_t counter,
                        uint8_t direction,
                        uint8_t header,
                        const uint8_t* plaintext,
                        uint8_t plaintextLen,
                        uint8_t* outCipherWithMic,
                        uint8_t* outCipherWithMicLen,
                        CcmBleDataRate dataRate = CcmBleDataRate::k125Kbit,
                        uint8_t adataMask = 0xE3U,
                        uint32_t spinLimit = 200000UL);
  bool decryptBlePacket(const uint8_t key[16],
                        const uint8_t iv[8],
                        uint64_t counter,
                        uint8_t direction,
                        uint8_t header,
                        const uint8_t* cipherWithMic,
                        uint8_t cipherWithMicLen,
                        uint8_t* outPlaintext,
                        uint8_t* outPlaintextLen,
                        bool* outMacValid = nullptr,
                        CcmBleDataRate dataRate = CcmBleDataRate::k125Kbit,
                        uint8_t adataMask = 0xE3U,
                        uint32_t spinLimit = 200000UL);
  uint32_t errorStatus() const;
  bool macStatus() const;
  void clearEvents();

