lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
enum class QdecInputPull : uint8_t {
  kDisabled = GPIO_PIN_CNF_PULL_Disabled,
  kPullDown = GPIO_PIN_CNF_PULL_Pulldown,
  kPullUp = GPIO_PIN_CNF_PULL_Pullup,
};

class Qdec {
 public:
  explicit Qdec(uint32_t base = nrf54l15::QDEC20_BASE);

  bool begin(const Pin& pinA,
             const Pin& pinB,
             QdecSamplePeriod samplePeriod = QdecSamplePeriod::k1024us,
             QdecReportPeriod reportPeriod = QdecReportPeriod::k1Sample,
             bool debounce = true,
             QdecInputPull inputPull = QdecInputPull::kPullUp,
             const Pin& ledPin = kPinDisconnected,
             QdecLedPolarity ledPolarity = QdecLedPolarity::kActiveLow,
             uint16_t ledPreUs = 16U);
  void end();
  void start();
  void stop();

  int32_t sampleValue() const;
  int32_t accumulator() const;
  int32_t readAndClearAccumulator();
  uint32_t doubleTransitions() const;
  uint32_t readAndClearDoubleTransitions();

  bool pollSampleReady(bool clearEvent = true);
  bool pollReportReady(bool clearEvent = true);
  bool pollOverflow(bool clearEvent = true);
  bool pollDoubleReady(bool clearEvent = true);
  bool pollStopped(bool clearEvent = true);

 private:
  NRF_QDEC_Type* qdec_;
  bool configured_;
};

enum class AdcResolution : uint8_t {
  k8bit = 0,
  k10bit = 1,
  k12bit = 2,
  k14bit = 3,
};

enum class AdcGain : uint8_t {
  k2 = 0,
  k1 = 1,
  k2over3 = 2,
  k2over4 = 3,
  k2over5 = 4,
  k2over6 = 5,
  k2over7 = 6,
  k2over8 = 7,
};

enum class AdcInternalInput : uint8_t {
  kAvdd = SAADC_CH_PSELP_INTERNAL_Avdd,
  kDvdd = SAADC_CH_PSELP_INTERNAL_Dvdd,
  kVdd = SAADC_CH_PSELP_INTERNAL_Vdd,
};

enum class AdcOversample : uint8_t {
  kBypass = nrf54l15::saadc::OVERSAMPLE_BYPASS,
  k2x = nrf54l15::saadc::OVERSAMPLE_2X,
  k4x = nrf54l15::saadc::OVERSAMPLE_4X,
  k8x = nrf54l15::saadc::OVERSAMPLE_8X,
  k16x = nrf54l15::saadc::OVERSAMPLE_16X,
  k32x = nrf54l15::saadc::OVERSAMPLE_32X,
  k64x = nrf54l15::saadc::OVERSAMPLE_64X,
  k128x = nrf54l15::saadc::OVERSAMPLE_128X,
  k256x = nrf54l15::saadc::OVERSAMPLE_256X,
};

class Saadc {
 public:
  explicit Saadc(uint32_t base = nrf54l15::SAADC_BASE);

  bool begin(AdcResolution resolution = AdcResolution::k12bit,
             uint32_t spinLimit = 2000000UL);
  bool begin(AdcResolution resolution, AdcOversample oversample,
             uint32_t spinLimit = 2000000UL);
  bool calibrate(uint32_t spinLimit = 2000000UL);
  void end();

  // Configures one active single-ended channel and disables the others.
  bool configureSingleEnded(uint8_t channel, const Pin& pin,
                            AdcGain gain = AdcGain::k2over8,
                            uint16_t tacq = 159,
                            uint8_t tconv = 4,
                            bool burst = false);
  bool configureSingleEnded(uint8_t channel, AdcInternalInput input,
                            AdcGain gain = AdcGain::k2over8,
                            uint16_t tacq = 159,
                            uint8_t tconv = 4,
                            bool burst = false);
  bool configureDifferential(uint8_t channel, const Pin& positivePin,
                             const Pin& negativePin,
                             AdcGain gain = AdcGain::k1,
                             uint16_t tacq = 159,
                             uint8_t tconv = 4,
                             bool burst = false);

  bool sampleRaw(int16_t* outRaw, uint32_t spinLimit = 2000000UL) const;
  bool sampleMilliVolts(int32_t* outMilliVolts,
                        uint32_t spinLimit = 2000000UL) const;
  bool sampleMilliVoltsSigned(int32_t* outMilliVolts,
                              uint32_t spinLimit = 2000000UL) const;

 private:
  uint32_t base_;
  AdcResolution resolution_;
  AdcGain gain_;
  AdcOversample oversample_;
  bool differential_;
  bool configured_;
};

enum class BoardAntennaPath : uint8_t {
  kCeramic = 0,
  kExternal = 1,
  kControlHighImpedance = 2,
};

class BoardControl {
 public:
  // Control the desired active RF switch path on P2.05:
  // - ceramic/external actively drive RF_SW_CTL
  // - control-high-impedance releases control pin (no active drive)
  static bool setAntennaPath(BoardAntennaPath path);

  // Returns the observed current RF switch route on the board without
  // changing the remembered desired active path.
  static BoardAntennaPath antennaPath();

  // Controls the shared IMU + microphone power/enable rail on XIAO nRF54L15.
  static bool setImuMicEnabled(bool enable);
  static bool imuMicEnabled();

  // Enables/disables the battery-divider path used for VBAT sense.
  static bool setBatterySenseEnabled(bool enable);

  // Powers the RF switch IC on P2.03. This is independent from the selected
  // RF path and can be disabled to remove the switch quiescent current.
  static bool setRfSwitchPowerEnabled(bool enable);
  static bool rfSwitchPowerEnabled();

  // Powers the RF switch and applies the requested route for an active RF
  // window such as a BLE TX/RX event.
  static bool enableRfPath(BoardAntennaPath path = BoardAntennaPath::kCeramic);

  // Releases RF_SW_CTL to the requested idle state and optionally removes the
  // RF switch supply to collapse board-side quiescent current while idle.
  static bool collapseRfPathIdle(
      BoardAntennaPath idlePath = BoardAntennaPath::kControlHighImpedance,
      bool disablePower = true);

  // Applies the board-level lowest-power state used before System OFF.
  static void enterLowestPowerState();

  // Reads VBAT in millivolts (divider-compensated, x2).
  // This method enables the divider path only for the sampling window.
  static bool sampleBatteryMilliVolts(int32_t* outMilliVolts,
                                      uint32_t settleDelayUs = 5000U,
                                      uint32_t spinLimit = 500000UL);

  // Reads the chip VDD rail through the SAADC internal VDD input.
  // This does not consume an external analog pin and is not raw VBAT.
  static bool sampleVddMilliVolts(int32_t* outMilliVolts,
                                  uint32_t spinLimit = 500000UL);

  // Approximate Li-ion state-of-charge from measured VBAT.
  // Defaults are intentionally conservative for 1-cell chemistry.
  static bool sampleBatteryPercent(uint8_t* outPercent,
                                   int32_t emptyMilliVolts = 3300,
                                   int32_t fullMilliVolts = 4200,
                                   uint32_t settleDelayUs = 5000U,
                                   uint32_t spinLimit = 500000UL);
};

enum class PowerLatencyMode : uint8_t {
  kLowPower = 0,
  kConstantLatency = 1,
};

enum class PowerFailThreshold : uint8_t {
  k1V7 = REGULATORS_POFCON_THRESHOLD_V17,
  k1V8 = REGULATORS_POFCON_THRESHOLD_V18,
  k1V9 = REGULATORS_POFCON_THRESHOLD_V19,
  k2V0 = REGULATORS_POFCON_THRESHOLD_V20,
  k2V1 = REGULATORS_POFCON_THRESHOLD_V21,
  k2V2 = REGULATORS_POFCON_THRESHOLD_V22,
  k2V3 = REGULATORS_POFCON_THRESHOLD_V23,
  k2V4 = REGULATORS_POFCON_THRESHOLD_V24,
  k2V5 = REGULATORS_POFCON_THRESHOLD_V25,
  k2V6 = REGULATORS_POFCON_THRESHOLD_V26,
  k2V7 = REGULATORS_POFCON_THRESHOLD_V27,
  k2V8 = REGULATORS_POFCON_THRESHOLD_V28,
  k2V9 = REGULATORS_POFCON_THRESHOLD_V29,
  k3V0 = REGULATORS_POFCON_THRESHOLD_V30,
  k3V1 = REGULATORS_POFCON_THRESHOLD_V31,
  k3V2 = REGULATORS_POFCON_THRESHOLD_V32,
};

class PowerManager {
 public:
  explicit PowerManager(uint32_t powerBase = nrf54l15::POWER_BASE,
                        uint32_t resetBase = nrf54l15::RESET_BASE,
                        uint32_t regulatorsBase = nrf54l15::REGULATORS_BASE);

  void setLatencyMode(PowerLatencyMode mode);
  bool isConstantLatency() const;

