lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
  bool setRetention(uint8_t index, uint8_t value);
  bool getRetention(uint8_t index, uint8_t* value) const;

  uint32_t resetReason() const;
  void clearResetReason(uint32_t mask);

  bool enableMainDcdc(bool enable);
  bool configurePowerFailComparator(
      PowerFailThreshold threshold = PowerFailThreshold::k2V8,
      bool enableWarningEvent = true);
  void disablePowerFailComparator();
  bool powerFailComparatorEnabled() const;
  PowerFailThreshold powerFailThreshold() const;
  bool powerBelowPowerFailThreshold() const;
  bool powerFailWarningEventEnabled() const;
  bool pollPowerFailWarning(bool clearEvent = true);
  void clearPowerFailWarning();

  // Default system-off paths preserve .noinit RAM retention.
  [[noreturn]] void systemOff();
  [[noreturn]] void systemOffTimedWakeMs(uint32_t delayMs);
  [[noreturn]] void systemOffTimedWakeUs(uint32_t delayUs);

  // Explicit low-power paths that clear RAM retention before SYSTEM OFF.
  [[noreturn]] void systemOffNoRetention();
  [[noreturn]] void systemOffTimedWakeMsNoRetention(uint32_t delayMs);
  [[noreturn]] void systemOffTimedWakeUsNoRetention(uint32_t delayUs);

 private:
  NRF_POWER_Type* power_;
  NRF_RESET_Type* reset_;
  NRF_REGULATORS_Type* regulators_;
};

enum class GrtcClockSource : uint8_t {
  kLfxo = GRTC_CLKCFG_CLKSEL_LFXO,
  kSystemLfclk = GRTC_CLKCFG_CLKSEL_SystemLFCLK,
  kLflprc = GRTC_CLKCFG_CLKSEL_LFLPRC,
};

class Grtc {
 public:
  explicit Grtc(uint32_t base = nrf54l15::GRTC_BASE,
                uint8_t compareChannelCount = 12);

  bool begin(GrtcClockSource clockSource = GrtcClockSource::kSystemLfclk);
  void end();
  void start();
  void stop();
  void clear();

  uint64_t counter() const;
  bool setWakeLeadLfclk(uint8_t cycles);

  bool setCompareOffsetUs(uint8_t channel, uint32_t offsetUs,
                          bool enableChannel = true);
  bool setCompareAbsoluteUs(uint8_t channel, uint64_t timestampUs,
                            bool enableChannel = true);
  bool enableCompareChannel(uint8_t channel, bool enable = true);
  void enableCompareInterrupt(uint8_t channel, bool enable = true);
  bool pollCompare(uint8_t channel, bool clearEvent = true);
  bool clearCompareEvent(uint8_t channel);

 private:
  NRF_GRTC_Type* grtc_;
  uint8_t compareChannelCount_;
};

class GrtcPwm {
 public:
  using IrqCallback = void (*)(uint32_t irqMask, void* context);

  static constexpr uint32_t kIrqPeriodEnd = GRTC_INTENSET2_PWMPERIODEND_Msk;
  static constexpr uint32_t kIrqReady = GRTC_INTENSET2_PWMREADY_Msk;

  explicit GrtcPwm(uint32_t base = nrf54l15::GRTC_BASE);

  static constexpr uint32_t frequencyHz() { return 32768UL / 256UL; }
  static constexpr uint32_t irqSupportedMask() {
    return kIrqPeriodEnd | kIrqReady;
  }

  static bool supportsPin(const Pin& outPin);
  static bool supportsArduinoPin(uint8_t arduinoPin);

  bool begin(const Pin& outPin, uint8_t duty8 = 128U,
             GrtcClockSource clockSource = GrtcClockSource::kSystemLfclk,
             bool startNow = true, uint32_t spinLimit = 600000UL);
  bool beginArduinoPin(uint8_t arduinoPin, uint8_t duty8 = 128U,
                       GrtcClockSource clockSource =
                           GrtcClockSource::kSystemLfclk,
                       bool startNow = true, uint32_t spinLimit = 600000UL);

  bool setDuty8(uint8_t duty8);
  bool setDutyPermille(uint16_t dutyPermille);
  uint8_t duty8() const;

  bool ready() const;
  bool pollReadyEvent(bool clearEvent = true);
  void enablePeriodEndEvent(bool enable = true);
  volatile uint32_t* publishReadyConfigRegister() const;
  uint32_t pendingInterruptMask() const;
  void clearInterruptEvents(uint32_t mask);
  void enableInterruptMask(uint32_t mask, bool enable = true);
  void setIrqCallback(IrqCallback callback, void* context = nullptr);
  bool makeActive(uint8_t irqPriority = 3U);
  bool start(uint32_t spinLimit = 600000UL);
  bool stop(uint32_t spinLimit = 600000UL);
  bool pollPeriodEnd(bool clearEvent = true);
  void end(uint32_t spinLimit = 600000UL);

 private:
  friend void nrf54l15_grtc_pwm_irq_service(void);
  void onIrq();
  bool takePin(const Pin& outPin);
  void restorePin();
  bool waitReady(uint32_t spinLimit) const;

  NRF_GRTC_Type* grtc_;
  Pin outPin_;
  uint32_t savedPinCnf_;
  bool savedOutputHigh_;
  bool pinOwned_;
  bool running_;
  uint8_t duty8_;
  IrqCallback irqCallback_;
  void* irqContext_;
};

class TempSensor {
 public:
  explicit TempSensor(uint32_t base = nrf54l15::TEMP_BASE);

  bool sampleQuarterDegreesC(int32_t* outQuarterDegreesC,
                             uint32_t spinLimit = 200000UL) const;
  bool sampleMilliDegreesC(int32_t* outMilliDegreesC,
                           uint32_t spinLimit = 200000UL) const;

 private:
  NRF_TEMP_Type* temp_;
};

class Watchdog {
 public:
  explicit Watchdog(uint32_t base = nrf54l15::WDT31_BASE);

  bool configure(uint32_t timeoutMs, uint8_t reloadRegister = 0,
                 bool runInSleep = true, bool runInDebugHalt = false,
                 bool allowStop = false);
  void start();
  bool stop(uint32_t spinLimit = 200000UL);
  bool feed(uint8_t reloadRegister = 0xFFU);
  bool isRunning() const;
  uint32_t requestStatus() const;

 private:
  NRF_WDT_Type* wdt_;
  uint8_t defaultReloadRegister_;
  bool allowStop_;
};

enum class PdmEdge : uint8_t {
  kLeftRising = PDM_MODE_EDGE_LeftRising,
  kLeftFalling = PDM_MODE_EDGE_LeftFalling,
};

class Pdm {
 public:
  explicit Pdm(uint32_t base = nrf54l15::PDM20_BASE);

  bool begin(const Pin& clk, const Pin& din, bool mono = true,
             uint8_t prescalerDiv = 40,
             uint8_t ratio = PDM_RATIO_RATIO_Ratio64,
             PdmEdge edge = PdmEdge::kLeftRising);
  void end();

  bool capture(int16_t* samples, size_t sampleCount,
               uint32_t spinLimit = 4000000UL);

 private:
  NRF_PDM_Type* pdm_;
  bool configured_;
};

struct I2sTxConfig {
  Pin mck = kPinDisconnected;
  Pin sck = kPinDisconnected;
  Pin lrck = kPinDisconnected;
  Pin sdin = kPinDisconnected;
  Pin sdout = kPinDisconnected;
  uint32_t mckFreq = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV8;
  uint32_t ratio = I2S_CONFIG_RATIO_RATIO_256X;
  uint32_t sampleWidth = I2S_CONFIG_SWIDTH_SWIDTH_16Bit;
  uint32_t align = I2S_CONFIG_ALIGN_ALIGN_Left;
  uint32_t format = I2S_CONFIG_FORMAT_FORMAT_I2S;
  uint32_t channels = I2S_CONFIG_CHANNELS_CHANNELS_Stereo;
  uint8_t irqPriority = 3U;
  bool enableMasterClock = true;
  bool autoRestart = true;
};

class I2sTx {
 public:
  using RefillCallback = void (*)(uint32_t* buffer, uint32_t wordCount,
                                  void* context);

  explicit I2sTx(uint32_t base = nrf54l15::I2S20_BASE);

  bool begin(const I2sTxConfig& config, uint32_t* buffer0, uint32_t* buffer1,
             uint32_t wordCount);
  void end();

  bool start();
  bool stop();
  void service();
  void onIrq();

