lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
  bool setBuffers(uint32_t* buffer0, uint32_t* buffer1, uint32_t wordCount);
  void setRefillCallback(RefillCallback callback, void* context = nullptr);
  bool makeActive();
  static void irqHandler();

  bool configured() const;
  bool running() const;
  bool restartPending() const;
  uint32_t txPtrUpdCount() const;
  uint32_t stoppedCount() const;
  uint32_t restartCount() const;
  uint32_t manualStopCount() const;

 private:
  void clearEvents();
  void armBuffer(uint8_t bufferIndex);

  NRF_I2S_Type* i2s_;
  I2sTxConfig config_;
  uint32_t* buffers_[2];
  uint32_t wordCount_;
  RefillCallback refillCallback_;
  void* refillContext_;
  uint8_t nextBufferIndex_;
  bool configured_;
  bool running_;
  bool restartPending_;
  uint32_t txPtrUpdCount_;
  uint32_t stoppedCount_;
  uint32_t restartCount_;
  uint32_t manualStopCount_;
};

struct I2sRxConfig {
  Pin mck = kPinDisconnected;
  Pin sck = kPinDisconnected;
  Pin lrck = kPinDisconnected;
  Pin sdin = kPinDisconnected;
  Pin sdout = kPinDisconnected;
  uint32_t mckFreq = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV8;
  uint32_t ratio = I2S_CONFIG_RATIO_RATIO_256X;
  uint32_t sampleWidth = I2S_CONFIG_SWIDTH_SWIDTH_16Bit;
  uint32_t align = I2S_CONFIG_ALIGN_ALIGN_Left;
  uint32_t format = I2S_CONFIG_FORMAT_FORMAT_I2S;
  uint32_t channels = I2S_CONFIG_CHANNELS_CHANNELS_Stereo;
  uint8_t irqPriority = 3U;
  bool enableMasterClock = true;
  bool autoRestart = true;
};

class I2sRx {
 public:
  using ReceiveCallback = void (*)(uint32_t* buffer, uint32_t wordCount,
                                   void* context);

  explicit I2sRx(uint32_t base = nrf54l15::I2S20_BASE);

  bool begin(const I2sRxConfig& config, uint32_t* buffer0, uint32_t* buffer1,
             uint32_t wordCount);
  void end();

  bool start();
  bool stop();
  void service();
  void onIrq();

  bool setBuffers(uint32_t* buffer0, uint32_t* buffer1, uint32_t wordCount);
  void setReceiveCallback(ReceiveCallback callback, void* context = nullptr);
  bool makeActive();
  static void irqHandler();

  bool configured() const;
  bool running() const;
  bool restartPending() const;
  uint32_t rxPtrUpdCount() const;
  uint32_t stoppedCount() const;
  uint32_t restartCount() const;
  uint32_t manualStopCount() const;

 private:
  void clearEvents();
  void armBuffer(uint8_t bufferIndex);

  NRF_I2S_Type* i2s_;
  I2sRxConfig config_;
  uint32_t* buffers_[2];
  uint32_t wordCount_;
  ReceiveCallback receiveCallback_;
  void* receiveContext_;
  uint8_t nextBufferIndex_;
  bool configured_;
  bool running_;
  bool restartPending_;
  uint32_t rxPtrUpdCount_;
  uint32_t stoppedCount_;
  uint32_t restartCount_;
  uint32_t manualStopCount_;
};

struct I2sDuplexConfig {
  Pin mck = kPinDisconnected;
  Pin sck = kPinDisconnected;
  Pin lrck = kPinDisconnected;
  Pin sdin = kPinDisconnected;
  Pin sdout = kPinDisconnected;
  uint32_t mckFreq = I2S_CONFIG_MCKFREQ_MCKFREQ_32MDIV8;
  uint32_t ratio = I2S_CONFIG_RATIO_RATIO_256X;
  uint32_t sampleWidth = I2S_CONFIG_SWIDTH_SWIDTH_16Bit;
  uint32_t align = I2S_CONFIG_ALIGN_ALIGN_Left;
  uint32_t format = I2S_CONFIG_FORMAT_FORMAT_I2S;
  uint32_t channels = I2S_CONFIG_CHANNELS_CHANNELS_Stereo;
  uint8_t irqPriority = 3U;
  bool enableMasterClock = true;
  bool autoRestart = true;
};

class I2sDuplex {
 public:
  using TxRefillCallback = void (*)(uint32_t* buffer, uint32_t wordCount,
                                    void* context);
  using RxReceiveCallback = void (*)(uint32_t* buffer, uint32_t wordCount,
                                     void* context);

  explicit I2sDuplex(uint32_t base = nrf54l15::I2S20_BASE);

  bool begin(const I2sDuplexConfig& config, uint32_t* txBuffer0,
             uint32_t* txBuffer1, uint32_t* rxBuffer0, uint32_t* rxBuffer1,
             uint32_t wordCount);
  void end();

  bool start();
  bool stop();
  void service();
  void onIrq();

  bool setTxBuffers(uint32_t* buffer0, uint32_t* buffer1, uint32_t wordCount);
  bool setRxBuffers(uint32_t* buffer0, uint32_t* buffer1, uint32_t wordCount);
  void setTxRefillCallback(TxRefillCallback callback, void* context = nullptr);
  void setRxReceiveCallback(RxReceiveCallback callback, void* context = nullptr);
  bool makeActive();
  static void irqHandler();

  bool configured() const;
  bool running() const;
  bool restartPending() const;
  uint32_t txPtrUpdCount() const;
  uint32_t rxPtrUpdCount() const;
  uint32_t stoppedCount() const;
  uint32_t restartCount() const;
  uint32_t manualStopCount() const;

 private:
  void clearEvents();
  void armTxBuffer(uint8_t bufferIndex);
  void armRxBuffer(uint8_t bufferIndex);

  NRF_I2S_Type* i2s_;
  I2sDuplexConfig config_;
  uint32_t* txBuffers_[2];
  uint32_t* rxBuffers_[2];
  uint32_t wordCount_;
  TxRefillCallback txRefillCallback_;
  void* txRefillContext_;
  RxReceiveCallback rxReceiveCallback_;
  void* rxReceiveContext_;
  uint8_t nextTxBufferIndex_;
  uint8_t nextRxBufferIndex_;
  bool configured_;
  bool running_;
  bool restartPending_;
  uint32_t txPtrUpdCount_;
  uint32_t rxPtrUpdCount_;
  uint32_t stoppedCount_;
  uint32_t restartCount_;
  uint32_t manualStopCount_;
};

struct ZigbeeFrame {
  uint8_t channel;
  int8_t rssiDbm;
  uint8_t length;
  uint8_t psdu[127];
};

struct ZigbeeDataFrameView {
  bool valid;
  bool ackRequested;
  uint8_t sequence;
  uint16_t panId;
  uint16_t destinationShort;
  uint16_t sourceShort;
  const uint8_t* payload;
  uint8_t payloadLength;
};

struct ZigbeeMacCommandView {
  bool valid;
  bool ackRequested;
  uint8_t sequence;
  uint16_t panId;
  uint16_t destinationShort;
  uint16_t sourceShort;
  uint8_t commandId;
  const uint8_t* payload;
  uint8_t payloadLength;
};

struct ZigbeeMacAcknowledgementView {
  bool valid;
  bool framePending;
  uint8_t sequence;
};

struct ZigbeeTransmitDebug {
  bool endSeen = false;
  bool disabledSeen = false;
  bool ccaBusy = false;
  bool ackRequested = false;
  bool ackReceived = false;
  bool ackFramePending = false;
  bool rxAttempted = false;
  bool rxDone = false;
  bool crcOk = false;
  bool crcError = false;
  bool syncSeen = false;
  bool rxReadySeen = false;
  bool frameStartSeen = false;
  bool addressSeen = false;
  bool rxAddressSeen = false;
  bool endEventSeen = false;
  bool devMatchSeen = false;
  bool devMissSeen = false;
  bool mhrMatchSeen = false;
  uint8_t txLength = 0U;
  uint8_t ackSequence = 0U;
  uint8_t rxLength = 0U;
  uint8_t rxSequence = 0U;
  uint32_t txEndTimestampUs = 0U;
  uint32_t disabledTimestampUs = 0U;
  uint32_t rxDoneTimestampUs = 0U;
};

