lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
struct ZigbeeReceiveDebug {
  uint32_t rxDoneCount = 0U;
  uint32_t crcErrorCount = 0U;
  uint32_t invalidLengthCount = 0U;
  uint32_t filteredCount = 0U;
  uint8_t lastPhr = 0U;
  uint8_t lastLength = 0U;
};

class ZigbeeRadio {
 public:
  using MacDataRequestPendingCallback = bool (*)(const uint8_t* psdu,
                                                 uint8_t length,
                                                 void* context);
  using MacFrameReceiveFilterCallback = bool (*)(const uint8_t* psdu,
                                                 uint8_t length,
                                                 void* context);

  explicit ZigbeeRadio(uint32_t radioBase = nrf54l15::RADIO_BASE);

  bool begin(uint8_t channel = 15U, int8_t txPowerDbm = 0);
  void end();

  bool setChannel(uint8_t channel);
  uint8_t channel() const;
  bool setTxPowerDbm(int8_t dbm);

  bool transmit(const uint8_t* psdu, uint8_t length, bool performCca = false,
                uint32_t spinLimit = 1400000UL);
  bool transmitThenReceive(const uint8_t* psdu, uint8_t length,
                           ZigbeeFrame* frame,
                           uint32_t listenWindowUs = 7000U,
                           bool performCca = false,
                           uint32_t spinLimit = 1400000UL);
  bool beginReceive(uint32_t spinLimit = 1400000UL);
  bool pollReceive(ZigbeeFrame* frame, uint32_t spinLimit = 1400000UL);
  void cancelReceive(uint32_t spinLimit = 1400000UL);
  bool receiverArmed() const;
  bool receive(ZigbeeFrame* frame, uint32_t listenWindowUs = 7000U,
               uint32_t spinLimit = 1400000UL);
  bool sampleEnergyDetect(uint8_t* outEdLevel, uint32_t spinLimit = 300000UL);
  ZigbeeTransmitDebug lastTransmitDebug() const;
  ZigbeeReceiveDebug lastReceiveDebug() const;
  void setMacDataRequestPendingCallback(MacDataRequestPendingCallback callback,
                                        void* context = nullptr);
  void setMacFrameReceiveFilterCallback(MacFrameReceiveFilterCallback callback,
                                        void* context = nullptr);

  static bool buildDataFrameShort(uint8_t sequence, uint16_t panId,
                                  uint16_t destinationShort,
                                  uint16_t sourceShort,
                                  const uint8_t* payload, uint8_t payloadLength,
                                  uint8_t* outPsdu, uint8_t* outLength,
                                  bool requestAck = false);
  static bool buildMacCommandFrameShort(uint8_t sequence, uint16_t panId,
                                        uint16_t destinationShort,
                                        uint16_t sourceShort,
                                        uint8_t commandId,
                                        const uint8_t* payload,
                                        uint8_t payloadLength, uint8_t* outPsdu,
                                        uint8_t* outLength,
                                        bool requestAck = false);
  static bool buildMacAcknowledgement(uint8_t sequence, uint8_t* outPsdu,
                                      uint8_t* outLength,
                                      bool framePending = false);
  static bool parseDataFrameShort(const uint8_t* psdu, uint8_t length,
                                  ZigbeeDataFrameView* outView);
  static bool parseMacCommandFrameShort(const uint8_t* psdu, uint8_t length,
                                        ZigbeeMacCommandView* outView);
  static bool parseMacAcknowledgement(const uint8_t* psdu, uint8_t length,
                                      ZigbeeMacAcknowledgementView* outView);

 private:
  bool configureIeee802154();
  bool performCcaCheck(uint32_t spinLimit);
  bool waitForMacAcknowledgement(uint8_t sequence,
                                 bool* outFramePending,
                                 uint32_t spinLimit);
  bool sendMacAcknowledgement(uint8_t sequence, bool framePending,
                              uint32_t spinLimit);
  bool shouldAcceptReceivedMacFrame(const uint8_t* psdu,
                                    uint8_t length) const;
  bool shouldSetMacAckFramePending(const uint8_t* psdu, uint8_t length) const;
  static bool frameRequestsMacAcknowledgement(const uint8_t* psdu,
                                              uint8_t length,
                                              uint8_t* outSequence);
  static bool enableMacAcknowledgementRequest(uint8_t* psdu, uint8_t length,
                                              uint8_t* outSequence);

  NRF_RADIO_Type* radio_;
  bool initialized_;
  bool rfPathOwnedByZigbee_;
  bool receiverArmed_;
  uint8_t channel_;
  alignas(4) uint8_t txPacket_[1 + 127];
  alignas(4) uint8_t rxPacket_[1 + 127];
  ZigbeeTransmitDebug lastTransmitDebug_{};
  ZigbeeReceiveDebug lastReceiveDebug_{};
  MacDataRequestPendingCallback macDataRequestPendingCallback_ = nullptr;
  void* macDataRequestPendingContext_ = nullptr;
  MacFrameReceiveFilterCallback macFrameReceiveFilterCallback_ = nullptr;
  void* macFrameReceiveFilterContext_ = nullptr;
};

struct RawRadioConfig {
  uint8_t frequencyOffsetMhz = 8U;
  uint32_t addressBase0 = 0xC2C2C2C2UL;
  uint8_t addressPrefix0 = 0xC2U;
  int8_t txPowerDbm = -8;
  uint8_t maxPayloadLength = 32U;
  uint32_t crcPolynomial = 0x11021UL;
  uint32_t crcInit = 0xFFFFUL;
  bool whiteningEnabled = false;
  bool bigEndian = true;
};

struct RawRadioPacket {
  uint8_t length;
  int8_t rssiDbm;
  uint8_t payload[255];
};

enum class RawRadioReceiveStatus : uint8_t {
  kIdle = 0,
  kPacket = 1,
  kCrcError = 2,
  kError = 3,
};

class RawRadioLink {
 public:
  explicit RawRadioLink(uint32_t radioBase = nrf54l15::RADIO_BASE);

  bool begin(const RawRadioConfig& config = RawRadioConfig());
  void end();

  bool setFrequencyOffsetMhz(uint8_t frequencyOffsetMhz);
  bool setPipe(uint32_t addressBase0, uint8_t addressPrefix0);
  bool setTxPowerDbm(int8_t dbm);

  bool transmit(const uint8_t* payload, uint8_t length,
                uint32_t spinLimit = 3000000UL);
  bool armReceive();
  RawRadioReceiveStatus pollReceive(RawRadioPacket* outPacket = nullptr,
                                    uint32_t spinLimit = 3000000UL);
  RawRadioReceiveStatus waitForReceive(RawRadioPacket* outPacket,
                                       uint32_t listenWindowUs,
                                       uint32_t spinLimit = 3000000UL);

  bool initialized() const;
  bool receiverArmed() const;
  uint8_t maxPayloadLength() const;
  const RawRadioConfig& config() const;

