lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
 private:
  bool configureProprietary1M();
  RawRadioReceiveStatus finishReceive(RawRadioPacket* outPacket,
                                      uint32_t spinLimit,
                                      bool timedOut);

  NRF_RADIO_Type* radio_;
  PowerManager power_;
  RawRadioConfig config_;
  bool initialized_;
  bool receiverArmed_;
  alignas(4) uint8_t txPacket_[1U + 255U];
  alignas(4) uint8_t rxPacket_[1U + 255U];
};

enum class BleAddressType : uint8_t {
  kPublic = 0,
  kRandomStatic = 1,
};

#if !defined(NRF54L15_CLEAN_BLE_DEFAULT_TX_DBM)
#define NRF54L15_CLEAN_BLE_DEFAULT_TX_DBM -8
#endif

enum class BleAdvPduType : uint8_t {
  kAdvInd = 0x00,
  kAdvDirectInd = 0x01,
  kAdvNonConnInd = 0x02,
  kScanReq = 0x03,
  kScanRsp = 0x04,
  kConnectInd = 0x05,
  kAdvScanInd = 0x06,
};

enum class BleAdvertisingChannel : uint8_t {
  k37 = 37,
  k38 = 38,
  k39 = 39,
};

static constexpr uint8_t kBleLegacyAddressLength = 6U;
static constexpr size_t kBleAddressStringLength = 18U;
static constexpr uint8_t kBleLegacyAdDataMaxLength = 31U;
static constexpr uint8_t kBleLegacyRawPayloadMaxLength =
    static_cast<uint8_t>(kBleLegacyAddressLength + kBleLegacyAdDataMaxLength);
static constexpr uint8_t kCustomGattUuid128Length = 16U;
// Current controller scope supports the documented 995-byte extended payload
// limit using one AUX_ADV_IND followed by three AUX_CHAIN_IND packets.
static constexpr uint16_t kBleExtendedAdvDataMaxLength = 995U;
static constexpr uint8_t kBleExtendedSecondaryPacketCountMax = 4U;

bool parseBleAddressString(const char* text,
                           uint8_t addressOut[kBleLegacyAddressLength]);
size_t formatBleAddressString(const uint8_t address[kBleLegacyAddressLength],
                              char* out, size_t outSize);

enum class BleConnectionRole : uint8_t {
  kNone = 0,
  kPeripheral = 1,
  kCentral = 2,
};

enum BlePhy : uint8_t {
  kBlePhyNone = 0x00U,
  kBlePhy1M = 0x01U,
  kBlePhy2M = 0x02U,
  kBlePhyCoded = 0x04U,
};

enum BleGattCharacteristicProperty : uint8_t {
  kBleGattPropRead = 0x02U,
  kBleGattPropWriteNoRsp = 0x04U,
  kBleGattPropWrite = 0x08U,
  kBleGattPropNotify = 0x10U,
  kBleGattPropIndicate = 0x20U,
};

struct BleScanPacket {
  BleAdvertisingChannel channel;
  int8_t rssiDbm;
  uint8_t pduHeader;
  uint8_t length;
  const uint8_t* payload;
};

struct BleActiveScanResult {
  BleAdvertisingChannel channel;
  int8_t advRssiDbm;
  uint8_t advHeader;
  // Raw legacy PDU payload copied from the air: [AdvA(6)] [AdvData(0..31)].
  uint8_t advPayloadLength;
  bool advertiserAddressRandom;
  uint8_t advertiserAddress[kBleLegacyAddressLength];
  uint8_t advPayload[kBleLegacyRawPayloadMaxLength];
  bool scanResponseReceived;
  int8_t scanRspRssiDbm;
  uint8_t scanRspHeader;
  // Raw legacy SCAN_RSP payload copied from the air: [AdvA(6)] [ScanRspData(0..31)].
  uint8_t scanRspPayloadLength;
  uint8_t scanRspPayload[kBleLegacyRawPayloadMaxLength];

  const uint8_t* advData() const {
    return (advPayloadLength > kBleLegacyAddressLength)
               ? &advPayload[kBleLegacyAddressLength]
               : nullptr;
  }

  uint8_t advDataLength() const {
    return (advPayloadLength > kBleLegacyAddressLength)
               ? static_cast<uint8_t>(advPayloadLength - kBleLegacyAddressLength)
               : 0U;
  }

  const uint8_t* scanRspData() const {
    return (scanRspPayloadLength > kBleLegacyAddressLength)
               ? &scanRspPayload[kBleLegacyAddressLength]
               : nullptr;
  }

  uint8_t scanRspDataLength() const {
    return (scanRspPayloadLength > kBleLegacyAddressLength)
               ? static_cast<uint8_t>(scanRspPayloadLength -
                                      kBleLegacyAddressLength)
               : 0U;
  }
};

struct BleExtendedScanResult {
  BleAdvertisingChannel primaryChannel;
  int8_t primaryRssiDbm;
  uint8_t primaryHeader;
  uint8_t primaryPayloadLength;
  uint8_t advMode;
  bool advertiserAddressRandom;
  uint8_t advertiserAddress[kBleLegacyAddressLength];
  uint16_t did;
  uint8_t sid;
  uint8_t auxChannel;
  uint8_t auxPhy;
  uint32_t auxOffsetUs;
  uint8_t secondaryPacketCount;
  uint16_t dataLength;
  uint8_t data[kBleExtendedAdvDataMaxLength];
  bool scanResponseReceived;
  int8_t scanRspRssiDbm;
  uint8_t scanRspSecondaryPacketCount;
  uint16_t scanRspDataLength;
  uint8_t scanRspData[kBleExtendedAdvDataMaxLength];
};

struct BleAdvInteraction {
  BleAdvertisingChannel channel;
  bool receivedScanRequest;
  bool scanResponseTransmitted;
  bool receivedConnectInd;
  bool connectIndChSel2;
  bool peerAddressRandom;
  int8_t rssiDbm;
  uint8_t peerAddress[6];
};

struct BleConnectionInfo {
  uint8_t peerAddress[6];
  bool peerAddressRandom;
  uint32_t accessAddress;
  uint32_t crcInit;
  uint16_t intervalUnits;
  uint16_t latency;
  uint16_t supervisionTimeoutUnits;
  uint8_t channelMap[5];
  uint8_t channelCount;
  uint8_t hopIncrement;
  uint8_t sleepClockAccuracy;
  uint8_t txPhy;
  uint8_t rxPhy;
};

struct BleConnectionEvent {
  bool eventStarted;
  bool packetReceived;
  bool crcOk;
  bool emptyAckTransmitted;
  bool packetIsNew;
  bool peerAckedLastTx;
  bool freshTxAllowed;
  bool implicitEmptyAck;
  bool terminateInd;
  bool disconnectReasonValid;
  bool disconnectReasonRemote;
  bool llControlPacket;
  bool attPacket;
  bool txPacketSent;
  uint16_t eventCounter;
  uint8_t dataChannel;
  uint8_t txPhy;
  uint8_t rxPhy;
  int8_t rssiDbm;
  uint8_t llid;
  uint8_t rxNesn;
  uint8_t rxSn;
  uint8_t disconnectReason;
  uint8_t llControlOpcode;
  uint8_t attOpcode;
  uint8_t payloadLength;
  uint8_t txLlid;
  uint8_t txNesn;
  uint8_t txSn;
  uint8_t txPayloadLength;
  const uint8_t* payload;
  const uint8_t* txPayload;
};

enum class BleDisconnectReason : uint8_t {
  kNone = 0U,
  kApi = 1U,
  kSupervisionTimeout = 2U,
  kPeerTerminate = 3U,
  kMicFailure = 4U,
  kInternalTerminate = 5U,
};

struct BleDisconnectDebug {
  uint32_t sequence;
  uint32_t nextEventUs;
  uint16_t eventCounter;
  uint16_t missedEventCount;
  uint8_t valid;
  uint8_t reason;
  uint8_t role;
  uint8_t errorCode;
  uint8_t expectedRxSn;
  uint8_t txSn;
  uint8_t freshTxAllowed;
  uint8_t txHistoryValid;
  uint8_t pendingTxValid;
  uint8_t pendingTxLlid;
  uint8_t pendingTxLength;
  uint8_t lastTxLlid;
  uint8_t lastTxLength;
  uint8_t lastTxOpcode;
  uint8_t lastRxLlid;
  uint8_t lastRxLength;
  uint8_t lastRxOpcode;
  uint8_t lastRxNesn;
  uint8_t lastRxSn;
  uint8_t lastPacketIsNew;
  uint8_t lastPeerAckedLastTx;
};

// Debug counters for link-layer encryption (LL_ENC_REQ/RSP, LL_START_ENC_REQ/RSP).
// Useful when pairing/bonding fails due to tight T_IFS timing.
struct BleEncryptionDebugCounters {
  uint32_t followupArmed;
  uint32_t followupEndSeen;
  uint32_t followupCrcOk;
  uint32_t followupStartEncReqSeen;
  uint32_t followupStartEncRspTxOk;
  uint32_t followupRxLlid1;
  uint32_t followupRxLlid2;
  uint32_t followupRxLlid3;
  uint8_t lastFollowHdr;
  uint8_t lastFollowLlid;
  uint8_t lastFollowLen;
  uint8_t lastFollowByte0;
  uint8_t lastFollowWasNew;
  uint8_t lastFollowWasDecrypted;
  uint16_t reservedFollow0;
  uint32_t lastFollowCounterLo;
  // Main (first) RX/TX observations for start-encryption debugging.
  uint32_t mainEncReqSeen;
  uint32_t mainStartEncReqSeen;
  uint32_t mainStartEncReqSeenDecrypted;
  uint32_t mainEncRspTxOk;
  uint32_t mainStartEncRspTxOk;
  // While awaiting LL_START_ENC_REQ, track any LL control PDU observed so we can
  // see what the peer is sending (plain vs encrypted) without spamming Serial.
  uint32_t startPendingControlRxSeen;
  uint8_t startPendingLastHdr;
  uint8_t startPendingLastLenRaw;
  uint8_t startPendingLastByte0;
  uint8_t startPendingLastDecrypted;
  // TXEN scheduling lag (relative to the intended target) for LL_ENC_RSP.
  uint32_t encRspTxenLagLastUs;
  uint32_t encRspTxenLagMaxUs;
  // Low-overhead MIC failure diagnostics (kept compact for serial print).
  uint32_t encRxMicFailCount;
  uint32_t encRxShortPduCount;
  uint32_t encRxLastMicFailCounterLo;
  uint8_t encRxLastMicFailHdr;
  uint8_t encRxLastMicFailLenRaw;
  uint8_t encRxLastMicFailDir;
  uint8_t encRxLastMicFailState;
  uint8_t encRxLastMicFailData0;
  uint8_t encRxLastMicFailData1;
  uint8_t encRxLastMicFailData2;
  uint8_t encRxLastMicFailData3;
  uint8_t encRxLastMicFailData4;
  // Encryption clear/transition reason breadcrumbs.
  uint32_t encStartRspRxCount;
  uint8_t encStartRspLastRawLen;
  uint8_t encStartRspLastDecrypted;
  uint8_t encStartRspLastHdr;
  uint8_t reserved0;
  uint32_t encPauseReqAcceptedCount;
  uint32_t encPauseRspRxCount;
  uint32_t encClearCount;
  uint8_t encLastClearReason;
  // TXEN scheduling lag diagnostics (all packets and encrypted packets).
  uint32_t txenLagLastUs;
  uint32_t txenLagMaxUs;
  uint32_t encTxenLagLastUs;
  uint32_t encTxenLagMaxUs;
  uint32_t encTxPacketCount;
  uint32_t encRandomHardwareCount;
  uint32_t encRandomFallbackCount;
  uint32_t encRandomPrefetchUseCount;
  uint32_t encRandomPrefetchFillCount;
  uint32_t encLastTxCounterLo;
  uint32_t encLastRxCounterLo;
  uint8_t encLastTxHdr;
  uint8_t encLastTxPlainLen;
  uint8_t encLastTxAirLen;
  uint8_t encLastTxWasFresh;
  uint8_t encLastTxWasEncrypted;
  uint8_t encLastRxHdr;
  uint8_t encLastRxLenRaw;
  uint8_t encLastRxWasNew;
  uint8_t encLastRxWasDecrypted;
  uint8_t reserved1;
  // Last observed ENC_REQ/ENC_RSP key material snapshots.
  uint8_t encLastSkdm[8];
  uint8_t encLastIvm[4];
  uint8_t encLastSkds[8];
  uint8_t encLastIvs[4];
  uint8_t encLastStk[16];
  uint8_t encLastSessionKey[16];
  uint8_t encLastSessionAltKey[16];
  uint8_t encLastSessionKeyValid;
  uint8_t encLastSessionAltKeyValid;
  uint8_t encRxLastMicFailPacketLen;
  uint8_t encRxLastMicFailPacket[32];
  uint8_t encLastRxDir;
  uint8_t encLastTxDir;
  // Connection-level timing and termination breadcrumbs piggyback on the
  // existing debug export so callers can inspect missed-event and caller-late
  // behavior without introducing a new public API.
  uint32_t connLatePollCount;
  uint32_t connRxTimeoutCount;
  uint32_t connRxCrcErrorCount;
  uint32_t connTxTimeoutCount;
  uint32_t connFollowupRxTimeoutCount;
  uint32_t connFollowupRxCrcErrorCount;
  uint32_t connDisconnectLocalCount;
  uint32_t connDisconnectRemoteCount;
  uint32_t connMissedEventCountLast;
  uint32_t connMissedEventCountMax;
  uint32_t connLastRxListenBudgetUs;
  uint32_t connLastFollowupListenBudgetUs;
  uint32_t txenLateCount;
  uint32_t connDeferredEventOverwriteCount;
  uint32_t connDeferredCallbackDropCount;
  uint32_t connDeferredTraceDropCount;
  uint32_t connImplicitAttProgressAckCount;
  uint32_t connChannelMapPendingCount;
  uint32_t connChannelMapAppliedCount;
  uint32_t connChannelMapDuplicateCount;
  uint32_t connChannelMapTimeoutAfterApplyCount;
  uint32_t connLastChannelMapRxEventCounter;
  uint32_t connLastChannelMapInstant;
  uint32_t connLastChannelMapAppliedEventCounter;
  uint32_t connLastChannelMapAppliedDataChannel;
  uint32_t connLastChannelMapTimeoutEventCounter;
  uint32_t connBgServiceThreadCount;
  uint32_t connBgServiceIsrCount;
  uint32_t connBgDueCount;
  uint32_t connBgWakeLagLastUs;
  uint32_t connBgWakeLagMaxUs;
  uint32_t connBgHfxoPrewarmArmCount;
  uint32_t connBgHfxoStopCount;
  uint32_t connBgHfxoFallbackStartCount;
  uint32_t connBgRxHardwareArmCount;
  uint32_t connBgRxHardwareFallbackCount;
  uint32_t connFastAttReadTurnaroundCount;
  uint32_t connFastLlControlTurnaroundCount;
  uint32_t connFastSignalingTurnaroundCount;
  uint32_t connAarResolveAttemptCount;
  uint32_t connAarResolveSuccessCount;
  uint32_t connAarResolveFailureCount;
  uint32_t connAarLastErrorStatus;
  uint8_t connLastDisconnectReason;
  uint8_t connLastDisconnectRemote;
  uint8_t connLastDisconnectValid;
  uint8_t reserved2;
};

struct BleBackgroundAdvertisingDebugCounters {
  uint32_t irqCompareCount;
  uint32_t serviceRunCount;
  uint32_t idleFallbackCount;
  uint32_t randomHardwareCount;
  uint32_t randomFallbackCount;
  uint32_t eventArmCount;
  uint32_t eventCompleteCount;
  uint32_t stageAdvanceCount;
  uint32_t rfPathPrewarmRestoreCount;
  uint32_t rfPathIdleCollapseCount;
  uint32_t constlatServiceObservedCount;
  uint32_t lowPowerReleaseCount;
  uint32_t constlatPrewarmHardwareCount;
  uint32_t constlatPrewarmFallbackCount;
  uint32_t txReadyCount;
  uint32_t txStartKickCount;
  uint32_t txKickRetryCount;
  uint32_t txKickFallbackCount;
  uint32_t clockIrqCount;
  uint32_t clockXotunedCount;
  uint32_t clockXotuneErrorCount;
  uint32_t clockXotuneFailedCount;
  uint32_t txSettleTimeoutCount;
  uint32_t txPhyendCount;
  uint32_t txDisabledCount;
  uint32_t lastEventStartUs;
  uint32_t lastCompletedEventStartUs;
  uint32_t lastServiceUs;
  uint32_t lastRandomDelayUs;
  uint8_t lastChannel;
  uint8_t currentStage;
  uint8_t enabled;
  uint8_t threeChannel;
  uint8_t rfPathManaged;
  uint8_t rfPathActive;
  uint8_t latencyManaged;
  uint8_t constlatActive;
  uint8_t lastRadioState;
  uint8_t lastTxReadySeen;
  uint8_t lastTxPhyendSeen;
  uint8_t lastTxDisabledSeen;
};

struct BleBondRecord {
  uint8_t peerAddress[6];
  uint8_t peerAddressRandom;
  uint8_t peerIdentityAddress[6];
  uint8_t peerIdentityAddressRandom;
  uint8_t localAddress[6];
  uint8_t localAddressRandom;
  uint8_t ltk[16];
  uint8_t rand[8];
  uint8_t peerIrk[16];
  uint8_t peerIrkValid;
  uint16_t ediv;
  uint8_t keySize;
  uint8_t reserved[2];
};

using BleBondLoadCallback = bool (*)(BleBondRecord* outRecord, void* context);
using BleBondSaveCallback = bool (*)(const BleBondRecord* record, void* context);
using BleBondClearCallback = bool (*)(void* context);
using BleTraceCallback = void (*)(const char* message, void* context);
using BleGattWriteCallback = void (*)(uint16_t valueHandle, const uint8_t* value,
                                      uint8_t valueLength, bool withResponse,
                                      void* context);

// Minimal BLE LL radio block (legacy ADV + passive scan) implemented on RADIO.
// This class intentionally avoids a full host/controller stack.
class BleRadio {
 public:
  static constexpr uint8_t kCustomGattMaxServices = 8U;
  static constexpr uint8_t kCustomGattMaxCharacteristics = 16U;
  static constexpr uint8_t kCustomGattMaxValueLength = 244U;

  explicit BleRadio(uint32_t radioBase = nrf54l15::RADIO_BASE,
                    uint32_t ficrBase = nrf54l15::FICR_BASE);

  bool begin(int8_t txPowerDbm = NRF54L15_CLEAN_BLE_DEFAULT_TX_DBM);
  void end();

  bool setTxPowerDbm(int8_t dbm);
  bool selectExternalAntenna(bool external);
  bool loadAddressFromFicr(bool forceRandomStatic = true);
  bool setDeviceAddressString(const char* addressText,
                              BleAddressType type = BleAddressType::kRandomStatic);
  bool setDeviceAddress(const uint8_t address[6],
                        BleAddressType type = BleAddressType::kRandomStatic);
  bool getDeviceAddressString(char* out, size_t outSize,
                              BleAddressType* typeOut = nullptr) const;
  bool getDeviceAddress(uint8_t addressOut[6], BleAddressType* typeOut = nullptr) const;

  bool setAdvertisingPduType(BleAdvPduType type);
  bool setAdvertisingChannelSelectionAlgorithm2(bool enabled);
  bool setAdvertisingData(const uint8_t* data, size_t len);
  bool setAdvertisingName(const char* name, bool includeFlags = true);
  bool setExtendedAdvertisingSid(uint8_t sid);
  bool setExtendedAdvertisingAuxChannel(uint8_t dataChannel);
  bool setExtendedAdvertisingData(const uint8_t* data, size_t len);
  bool setExtendedAdvertisingName(const char* name, bool includeFlags = true);
  bool setExtendedScanResponseData(const uint8_t* data, size_t len);
  bool setExtendedScanResponseName(const char* name);
  bool buildAdvertisingPacket();
  bool setGattDeviceName(const char* name);
  bool setGattAppearance(uint16_t appearance);
  bool setGattBatteryLevel(uint8_t percent);
  bool clearCustomGatt();
  bool addCustomGattService(uint16_t uuid16, uint16_t* outServiceHandle = nullptr);
  bool addCustomGattService128(const uint8_t uuid128[16],
                               uint16_t* outServiceHandle = nullptr);
  // Characteristics can only be appended to the most recently added custom
  // service, matching Zephyr's static service-table ordering model.
  bool addCustomGattCharacteristic(uint16_t serviceHandle, uint16_t uuid16,
                                   uint8_t properties,
                                   const uint8_t* initialValue = nullptr,
                                   uint8_t initialValueLength = 0U,
                                   uint16_t* outValueHandle = nullptr,
                                   uint16_t* outCccdHandle = nullptr);
  bool addCustomGattCharacteristic128(uint16_t serviceHandle,
                                      const uint8_t uuid128[16],
                                      uint8_t properties,
                                      const uint8_t* initialValue = nullptr,
                                      uint8_t initialValueLength = 0U,
                                      uint16_t* outValueHandle = nullptr,
                                      uint16_t* outCccdHandle = nullptr);
  bool setCustomGattCharacteristicValue(uint16_t valueHandle,
                                        const uint8_t* value,
                                        uint8_t valueLength);
  bool getCustomGattCharacteristicValue(uint16_t valueHandle,
                                        uint8_t* outValue,
                                        uint8_t* inOutValueLength) const;
  bool notifyCustomGattCharacteristic(uint16_t valueHandle,
                                      bool indicate = false);
  bool isCustomGattCccdEnabled(uint16_t valueHandle,
                               bool indication = false) const;
  bool isCustomGattNotificationQueued(uint16_t valueHandle,
                                      bool indicate = false) const;
  uint16_t currentDataLength() const;
  uint16_t currentAttMtu() const;
  uint8_t currentTxPhy() const;
  uint8_t currentRxPhy() const;
  uint8_t getPHY() const;
  uint8_t maxNotificationValueLength() const;
  bool setCustomGattWriteHandler(uint16_t valueHandle,
                                 BleGattWriteCallback callback,
                                 void* context = nullptr);
  void setCustomGattWriteCallback(BleGattWriteCallback callback,
                                  void* context = nullptr);

  bool setScanResponseData(const uint8_t* data, size_t len);
  bool setScanResponseName(const char* name);
  bool buildScanResponsePacket();
  // Set advertising to Flags + a single 128-bit service UUID (canonical big-endian
  // input, reversed to BLE little-endian on air).  Automatically moves the GAP
  // device name to the scan response if no scan-response data has been set yet.
  bool setAdvertisingServiceUuid128(const uint8_t uuid128[kCustomGattUuid128Length]);

