lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
  // TX-only legacy advertising helpers. These do not listen for SCAN_REQ or
  // CONNECT_IND, so they require kAdvNonConnInd.
  bool advertiseOnce(BleAdvertisingChannel channel,
                     uint32_t spinLimit = 600000UL);
  bool advertiseEvent(uint32_t interChannelDelayUs = 350U,
                      uint32_t spinLimit = 600000UL);
  // First controller-offload milestone: one legacy non-connectable advertising
  // packet on one primary advertising channel with fixed interval scheduling.
  // Optional Bluetooth random advertising delay is applied inside the
  // background scheduler when requested. Software still owns interval
  // programming and packet state; GRTC/DPPI/PPIB own the exact HFXO/RADIO
  // launch path for each event.
  bool beginBackgroundAdvertising(
      uint32_t intervalMs,
      BleAdvertisingChannel channel = BleAdvertisingChannel::k37,
      uint32_t hfxoLeadUs = 1200U,
      bool addRandomDelay = false);
  bool beginBackgroundAdvertising3Channel(uint32_t intervalMs,
                                          uint32_t interChannelDelayUs = 350U,
                                          uint32_t hfxoLeadUs = 1200U,
                                          bool addRandomDelay = false);
  void stopBackgroundAdvertising();
  bool isBackgroundAdvertisingEnabled() const;
  uint8_t getBackgroundAdvertisingLastStopReason() const;
  void getBackgroundAdvertisingDebugCounters(
      BleBackgroundAdvertisingDebugCounters* out) const;
  void clearBackgroundAdvertisingDebugCounters();
  bool advertiseExtendedEvent(uint32_t auxOffsetUs = 3000U,
                              uint32_t interPrimaryDelayUs = 350U,
                              uint32_t spinLimit = 600000UL);
  bool advertiseExtendedScannableEvent(uint32_t auxOffsetUs = 3000U,
                                       uint32_t interPrimaryDelayUs = 350U,
                                       uint32_t requestListenSpinLimit = 250000UL,
                                       uint32_t spinLimit = 600000UL);

  // Advertise and listen for SCAN_REQ / CONNECT_IND on a single channel.
  // Use kAdvInd or kAdvScanInd. Directed legacy advertising is not supported
  // by this helper.
  bool advertiseInteractOnce(BleAdvertisingChannel channel,
                             BleAdvInteraction* interaction,
                             uint32_t requestListenSpinLimit = 250000UL,
                             uint32_t spinLimit = 700000UL);
  bool advertiseInteractEvent(BleAdvInteraction* interaction,
                              uint32_t interChannelDelayUs = 350U,
                              uint32_t requestListenSpinLimit = 250000UL,
                              uint32_t spinLimit = 700000UL);

  bool initiateConnection(const uint8_t peerAddress[6], bool peerAddressRandom,
                          uint16_t intervalUnits = 24U,
                          uint16_t supervisionTimeoutUnits = 200U,
                          uint8_t hopIncrement = 9U,
                          uint32_t perChannelScanSpinLimit = 300000UL);
  bool queueAttRequest(const uint8_t* attPayload, uint8_t attPayloadLength);
  bool queueAttReadRequest(uint16_t handle);
  bool queueAttWriteRequest(uint16_t handle, const uint8_t* value,
                            uint8_t valueLength, bool withResponse = true);
  bool queueAttCccdWrite(uint16_t cccdHandle, bool notify,
                         bool indicate = false, bool withResponse = true);
  void setPreferredConnectionParameters(uint16_t intervalMinUnits,
                                        uint16_t intervalMaxUnits,
                                        uint16_t latency,
                                        uint16_t timeoutUnits);
  bool setPreferredPhyOptions(uint8_t txPhys, uint8_t rxPhys);
  bool requestPHY(uint8_t phy);
  bool requestPreferredPhy(uint8_t txPhys, uint8_t rxPhys);
  bool requestDataLengthUpdate();
  bool requestAttMtuExchange(uint16_t mtu);
  bool isConnected() const;
  BleConnectionRole connectionRole() const;
  bool isConnectionEncrypted() const;
  // Send an SMP Security Request (peripheral → central) to prompt the central
  // to initiate LE legacy JustWorks pairing.  Call once after each connection
  // when no stored bond is expected.  Returns false if a bond is already primed
  // or encryption is already in progress.
  bool sendSmpSecurityRequest();
  bool getConnectionInfo(BleConnectionInfo* info) const;
  void getEncryptionDebugCounters(BleEncryptionDebugCounters* out) const;
  void clearEncryptionDebugCounters();
  bool getDisconnectDebug(BleDisconnectDebug* out) const;
  void clearDisconnectDebug();
  bool hasBondRecord() const;
  bool getBondRecord(BleBondRecord* outRecord) const;
  bool clearBondRecord(bool clearPersistentStorage = true);
  void setBondPersistenceCallbacks(BleBondLoadCallback loadCallback,
                                   BleBondSaveCallback saveCallback,
                                   BleBondClearCallback clearCallback = nullptr,
                                   void* context = nullptr);
  void setTraceCallback(BleTraceCallback callback, void* context = nullptr);
  bool getLastDisconnectReason(uint8_t* outReason,
                               bool* outRemote = nullptr) const;
  bool getLatestConnectionRssiDbm(int8_t* outRssiDbm) const;
  bool disconnect(uint32_t spinLimit = 300000UL);
  bool pollConnectionEvent(BleConnectionEvent* event = nullptr,
                           uint32_t spinLimit = 400000UL);
  void setBackgroundConnectionServiceEnabled(bool enabled);
  bool isBackgroundConnectionServiceEnabled() const;
  bool consumeDeferredConnectionEvent(BleConnectionEvent* event);

  bool scanOnce(BleAdvertisingChannel channel, BleScanPacket* packet,
                uint32_t spinLimit = 900000UL);
  bool scanCycle(BleScanPacket* packet, uint32_t perChannelSpinLimit = 300000UL);
  bool scanActiveOnce(BleAdvertisingChannel channel, BleActiveScanResult* result,
                      uint32_t advListenSpinLimit = 900000UL,
                      uint32_t scanRspListenSpinLimit = 300000UL,
                      uint32_t spinLimit = 900000UL);
  bool scanActiveCycle(BleActiveScanResult* result,
                       uint32_t perChannelAdvListenSpinLimit = 300000UL,
                       uint32_t scanRspListenSpinLimit = 300000UL);
  bool scanExtendedOnce(BleAdvertisingChannel channel,
                        BleExtendedScanResult* result,
                        uint32_t primaryListenSpinLimit = 900000UL,
                        uint32_t secondaryListenSpinLimit = 300000UL,
                        uint32_t spinLimit = 900000UL);
  bool scanExtendedCycle(BleExtendedScanResult* result,
                         uint32_t perChannelPrimaryListenSpinLimit = 300000UL,
                         uint32_t secondaryListenSpinLimit = 300000UL);
  bool scanExtendedActiveOnce(BleAdvertisingChannel channel,
                              BleExtendedScanResult* result,
                              uint32_t primaryListenSpinLimit = 900000UL,
                              uint32_t secondaryListenSpinLimit = 300000UL,
                              uint32_t scanRspListenSpinLimit = 300000UL,
                              uint32_t spinLimit = 900000UL);
  bool scanExtendedActiveCycle(BleExtendedScanResult* result,
                               uint32_t perChannelPrimaryListenSpinLimit = 300000UL,
                               uint32_t secondaryListenSpinLimit = 300000UL,
                               uint32_t scanRspListenSpinLimit = 300000UL);

