lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
 private:
  friend void ::nrf54l15_clean_ble_idle_service(void);
  friend void ::nrf54l15_clean_ble_yield_service(void);
  static constexpr uint16_t kCustomGattHandleStart = 0x0020U;
  static constexpr uint16_t kCustomGattHandleEnd = 0x00FFU;

  struct BleCustomUuidState {
    uint8_t length;
    uint8_t bytes[kCustomGattUuid128Length];
  };

  struct BleCustomServiceState {
    uint8_t uuidSize;
    uint8_t uuid[16];
    uint16_t serviceHandle;
    uint16_t endHandle;
  };

  struct BleCustomCharacteristicState {
    uint16_t serviceHandle;
    uint8_t uuidSize;
    uint8_t uuid[16];
    uint8_t properties;
    uint16_t declarationHandle;
    uint16_t valueHandle;
    uint16_t cccdHandle;
    uint16_t cccdValue;
    uint8_t valueLength;
    uint8_t value[kCustomGattMaxValueLength];
  };

  struct BleCustomWriteHandlerState {
    uint16_t valueHandle;
    BleGattWriteCallback callback;
    void* context;
  };

  struct BleDeferredGattWriteState {
    BleGattWriteCallback callback;
    void* context;
    uint16_t valueHandle;
    uint8_t valueLength;
    uint8_t withResponse;
    uint8_t value[kCustomGattMaxValueLength];
  };

  struct BleLegacyAdvertisingConfigSnapshot {
    BleAddressType addressType;
    BleAdvPduType pduType;
    bool useChSel2;
    bool scanRspDataAutoDefault;
    uint8_t address[6];
    uint8_t advData[kBleLegacyAdDataMaxLength];
    size_t advDataLen;
    uint8_t scanRspData[kBleLegacyAdDataMaxLength];
    size_t scanRspDataLen;
  };

  struct BleBackgroundAdvertisingRestartState {
    bool active;
    bool threeChannel;
    bool randomDelay;
    BleAdvertisingChannel channel;
    uint32_t intervalMs;
    uint32_t interChannelDelayUs;
    uint32_t hfxoLeadUs;
  };

  struct BleQueuedCustomNotificationState;

  bool configureBle1M();
  bool configureBlePhy(uint8_t phy);
  bool beginUnconnectedRadioActivity(uint32_t spinLimit = 1500000UL);
  void endUnconnectedRadioActivity();
  bool ensureRfPathActiveForBle();
  void releaseRfPathForBle();
  void captureLegacyAdvertisingConfigSnapshot(
      BleLegacyAdvertisingConfigSnapshot* out) const;
  void restoreLegacyAdvertisingConfigSnapshot(
      const BleLegacyAdvertisingConfigSnapshot& snapshot);
  void captureBackgroundAdvertisingRestartState(
      BleBackgroundAdvertisingRestartState* out) const;
  bool restartBackgroundAdvertisingFromState(
      const BleBackgroundAdvertisingRestartState& state);
  void snapshotBackgroundAdvertisingRfPathRestoreState();
  void restoreBackgroundAdvertisingRfPathRestoreState();
  bool buildExtendedAdvertisingPackets(uint32_t auxOffsetUs,
                                       uint32_t* actualAuxOffsetUs = nullptr);
  bool buildExtendedScannableAdvertisingPackets(
      uint32_t auxOffsetUs,
      uint32_t* actualAuxOffsetUs = nullptr,
      uint32_t* actualScanRspChainOffsetUs = nullptr);
  bool kickPreparedPacketOnCurrentChannel(const uint8_t* packet);
  bool transmitPreparedPacketOnCurrentChannel(const uint8_t* packet,
                                              uint32_t spinLimit,
                                              uint32_t* txReadyUs = nullptr);
  bool advertiseOncePrepared(BleAdvertisingChannel channel, uint32_t spinLimit);
  bool advertiseInteractOncePrepared(BleAdvertisingChannel channel,
                                     BleAdvInteraction* interaction,
                                     uint32_t requestListenSpinLimit,
                                     uint32_t spinLimit);
  bool receivePacketOnCurrentChannel(uint32_t listenSpinLimit,
                                     uint32_t spinLimit,
                                     uint8_t* outHeader,
                                     uint8_t* outPayloadLength,
                                     const uint8_t** outPayload,
                                     int8_t* outRssiDbm,
                                     uint32_t* outStartUs = nullptr,
                                     uint32_t* outEndUs = nullptr);
  bool handleExtendedScanRequestAndMaybeRespond(uint32_t requestListenSpinLimit,
                                                uint32_t scanRspChainOffsetUs,
                                                uint32_t spinLimit);
  bool waitDisabled(uint32_t spinLimit);
  bool waitForEnd(uint32_t spinLimit);
  bool setAdvertisingChannel(BleAdvertisingChannel channel);
  bool setDataChannel(uint8_t dataChannel);
  bool initiateConnectionOnce(BleAdvertisingChannel channel,
                              const uint8_t peerAddress[6],
                              bool peerAddressRandom, uint16_t intervalUnits,
                              uint16_t supervisionTimeoutUnits,
                              uint8_t hopIncrement,
                              uint32_t advListenSpinLimit,
                              uint32_t spinLimit);
  bool handleRequestAndMaybeRespond(BleAdvertisingChannel channel,
                                    BleAdvInteraction* interaction,
                                    uint32_t requestListenSpinLimit,
                                    uint32_t spinLimit);
  bool startCentralConnection(const uint8_t peerAddress[6],
                              bool peerAddressRandom,
                              uint32_t accessAddress, uint32_t crcInit,
                              uint16_t intervalUnits,
                              uint16_t supervisionTimeoutUnits,
                              uint8_t hopIncrement, bool useChSel2,
                              uint32_t connectIndEndUs);
  bool startConnectionFromConnectInd(const uint8_t* payload, uint8_t length,
                                     bool peerAddressRandom, bool useChSel2,
                                     uint32_t connectIndEndUs);
  bool addCustomGattServiceCommon(const uint8_t* uuid, uint8_t uuidSize,
                                  uint16_t* outServiceHandle);
  bool addCustomGattCharacteristicCommon(uint16_t serviceHandle,
                                         const uint8_t* uuid, uint8_t uuidSize,
                                         uint8_t properties,
                                         const uint8_t* initialValue,
                                         uint8_t initialValueLength,
                                         uint16_t* outValueHandle,
                                         uint16_t* outCccdHandle);
  bool pollCentralConnectionEvent(BleConnectionEvent* event,
                                  uint32_t spinLimit);
  bool buildLlControlResponse(const uint8_t* payload, uint8_t length,
                              uint16_t currentEventCounter,
                              uint8_t* outPayload, uint8_t* outLength,
                              bool* terminateInd);
  bool buildAttResponse(const uint8_t* attRequest, uint16_t requestLength,
                        uint8_t* outAttResponse, uint16_t* outAttResponseLength);
  bool buildL2capResponse(const uint8_t* l2capPayload, uint8_t l2capPayloadLength,
                          uint8_t* outPayload, uint8_t* outPayloadLength);
  bool buildL2capAttResponse(const uint8_t* l2capPayload, uint8_t l2capPayloadLength,
                             uint8_t* outPayload, uint8_t* outPayloadLength);
  bool buildL2capSignalingResponse(const uint8_t* l2capPayload,
                                   uint8_t l2capPayloadLength,
                                   uint8_t* outPayload,
                                   uint8_t* outPayloadLength);
  bool buildL2capSmpResponse(const uint8_t* l2capPayload,
                             uint8_t l2capPayloadLength,
                             uint8_t* outPayload,
                             uint8_t* outPayloadLength);
  uint16_t currentTxDataPduPayloadLength() const;
  uint16_t currentRxDataPduPayloadLength() const;
  uint16_t currentMaxAttPayloadLength() const;
  uint16_t currentDataLengthMaxTimeUs() const;
  uint16_t localMaxDataPduPayloadLength() const;
  uint16_t localPreferredAttMtu() const;
  uint8_t supportedBlePhys(uint8_t phys) const;
  uint8_t symmetricBlePhys(uint8_t txPhys, uint8_t rxPhys) const;
  uint8_t preferredSymmetricBlePhys() const;
  uint8_t normalizedLocalBlePhys(uint8_t phys) const;
  uint8_t selectPreferredBlePhy(uint8_t phys) const;
  bool connectionUsesCodedPhy() const;
  uint16_t minimumDataLengthTimeUsForPhy(uint8_t phy) const;
  uint16_t maximumDataLengthTimeUsForPhy(uint8_t phy) const;
  uint16_t payloadOctetsForDataLengthTimeUs(uint16_t maxTimeUs,
                                            uint8_t phy) const;
  void updateConnectionDataLengthFromPeer(uint16_t peerMaxRxOctets,
                                          uint16_t peerMaxRxTimeUs,
                                          uint16_t peerMaxTxOctets,
                                          uint16_t peerMaxTxTimeUs);
  bool queuePhyUpdateRequest();
  bool connParamsAreValid(uint16_t intervalMin, uint16_t intervalMax,
                          uint16_t latency, uint16_t timeout) const;
  uint16_t chooseAcceptedConnIntervalUnits(uint16_t intervalMin,
                                           uint16_t intervalMax) const;
  bool queueCentralDataLengthRequest();
  bool queueCentralAttMtuRequest();
  bool queuePeripheralConnParamUpdateRequest();
  bool queueCentralConnParamUpdateInd();
  void maybeQueueCentralLinkSetupRequest();
  bool applyPendingConnectionPhyUpdateAtInstant(uint16_t currentEventCounter);
  void applyPendingConnectionUpdateAtInstant(uint16_t currentEventCounter,
                                             uint32_t currentEventAnchorUs);
  void clearPreparedWriteState();
  bool applyCccdState(uint16_t handle, uint16_t cccd);
  bool buildAttErrorResponse(uint8_t requestOpcode, uint16_t handle,
                             uint8_t errorCode, uint8_t* outAttResponse,
                             uint16_t* outAttResponseLength) const;
  uint8_t readAttributeValue(uint16_t handle, uint16_t offset, uint8_t* outValue,
                             uint8_t maxLen) const;
  void clearSmpPairingState();
  void clearEncryptionState();
  void clearConnectionSecurityState();
  void prefetchConnectionSecurityMaterial(uint32_t spinLimit);
  bool isBondRecordUsable(const BleBondRecord& record) const;
  bool loadBondRecordFromPersistence();
  bool persistBondRecord(const BleBondRecord& record);
  bool clearPersistentBondRecord();
  bool buildCurrentBondRecord(BleBondRecord* outRecord) const;
  bool primeBondForCurrentPeer();
  void clearCustomGattConnectionState();
  bool addCustomGattServiceUuid(const uint8_t* uuidBytes, uint8_t uuidLength,
                                uint16_t* outServiceHandle);
  bool addCustomGattCharacteristicUuid(uint16_t serviceHandle,
                                       const uint8_t* uuidBytes,
                                       uint8_t uuidLength,
                                       uint8_t properties,
                                       const uint8_t* initialValue,
                                       uint8_t initialValueLength,
                                       uint16_t* outValueHandle,
                                       uint16_t* outCccdHandle);
  BleCustomServiceState* findCustomServiceByHandle(uint16_t serviceHandle);
  const BleCustomServiceState* findCustomServiceByHandle(uint16_t serviceHandle) const;
  BleCustomCharacteristicState* findCustomCharacteristicByValueHandle(uint16_t valueHandle);
  const BleCustomCharacteristicState* findCustomCharacteristicByValueHandle(
      uint16_t valueHandle) const;
  BleCustomWriteHandlerState* findCustomGattWriteHandler(uint16_t valueHandle);
  const BleCustomWriteHandlerState* findCustomGattWriteHandler(
      uint16_t valueHandle) const;
  BleCustomCharacteristicState* findCustomCharacteristicByCccdHandle(uint16_t cccdHandle);
  const BleCustomCharacteristicState* findCustomCharacteristicByCccdHandle(
      uint16_t cccdHandle) const;
  bool writeCustomGattCharacteristic(uint16_t handle, const uint8_t* value,
                                     uint16_t valueLength, bool withResponse,
                                     uint8_t* outErrorCode);
  void emitBleTrace(const char* message) const;
  void rememberDisconnectReason(uint8_t reason, bool remote);
  bool prepareBackgroundAdvertisingEvent();
  bool configureBackgroundAdvertisingHardware(bool enable);
  bool armBackgroundAdvertising(uint32_t targetTxUs, bool prewarmHfxo,
                                bool stopHfxoAfterTx);
  bool rescheduleBackgroundAdvertisingTxCompare(uint8_t compareChannel);
  bool rescheduleBackgroundAdvertisingService(uint8_t compareChannel);
  bool reconfigureBackgroundAdvertisingTxKick(bool useIrqKick);
  bool handleBackgroundAdvertisingPrewarmEvent();
  bool settleBackgroundAdvertisingRadioBeforeService(uint32_t waitBudgetUs);
  void collapseBackgroundAdvertisingRfPathIfManaged();
  bool backgroundAdvertisingConsumePendingPrewarmFromFallback();
  bool backgroundAdvertisingNeedsIdleService() const;
  bool backgroundAdvertisingConsumePendingCompareFromFallback();
  bool serviceBackgroundAdvertising();
  bool backgroundServicesActive() const;
  bool configureBackgroundConnectionHardware(bool enable);
  bool previewBackgroundConnectionDataChannel(uint8_t* outDataChannel) const;
  bool prepareBackgroundConnectionReceiveWindow(uint32_t rxStartUs);
  bool armBackgroundConnectionService();
  void stopBackgroundConnectionService();
  void snapshotDeferredConnectionEvent(const BleConnectionEvent& event);
  bool serviceBackgroundConnectionEvent();
  bool enqueueDeferredGattWrite(BleGattWriteCallback callback, void* context,
                                uint16_t valueHandle, const uint8_t* value,
                                uint8_t valueLength, bool withResponse);
  void dispatchDeferredGattWrites();
  bool enqueueDeferredTrace(const char* message);
  void dispatchDeferredTraces();
  void serviceDeferredApplicationWork();
  static void resetConnectionEventStruct(BleConnectionEvent* event);
  bool disconnectWithReason(BleDisconnectReason reason, uint8_t errorCode,
                            uint32_t spinLimit);
  bool pollConnectionEventInternal(BleConnectionEvent* event,
                                   uint32_t spinLimit);
  void serviceBackgroundConnection(uint32_t spinLimit = 120000UL);
  void clearQueuedConnectionEvents();
  bool enqueueConnectionEvent(const BleConnectionEvent& event);
  bool dequeueConnectionEvent(BleConnectionEvent* event);
  static bool shouldQueueConnectionEvent(const BleConnectionEvent& event);
  void rememberLatestConnectionRssi(const BleConnectionEvent& event);
  bool enqueueCustomGattNotification(uint8_t characteristicIndex, bool indicate,
                                     const uint8_t* value,
                                     uint8_t valueLength);
  bool peekCustomGattNotification(
      BleQueuedCustomNotificationState* outNotification) const;
  void popCustomGattNotification();
  void filterCustomGattNotificationQueue(uint8_t characteristicIndex,
                                         bool notificationsEnabled,
                                         bool indicationsEnabled);
  void resetDisconnectDebugState();
  void rememberConnectionRxDebug(uint8_t llid, uint8_t rxLength,
                                 uint8_t protocolOpcode, uint8_t nesn,
                                 uint8_t sn, bool packetIsNew,
                                 bool peerAckedLastTx);
  void recordDisconnectDebug(BleDisconnectReason reason, uint8_t errorCode);
  void updateNextConnectionEventTime();
  void armConnectionResyncWindow(uint32_t extraPostAnchorUs, uint8_t attempts);
  uint8_t selectNextDataChannel(bool useCurrentEventCounter);
  void restoreAdvertisingLinkDefaults();
  static uint32_t txPowerRegFromDbm(int8_t dbm);
  friend void nrf54l15_ble_idle_service(void);
  friend void nrf54l15_ble_grtc_irq_service(void);
  friend void nrf54l15_ble_clock_irq_service(void);
  friend uint32_t nrf54l15_ble_grtc_reserved_cc_mask(void);

  static constexpr uint8_t kConnectionEventQueueDepth = 4U;
  static constexpr uint8_t kCustomGattNotificationQueueDepth = 8U;
  struct BleQueuedConnectionEvent {
    BleConnectionEvent event;
    uint8_t payload[255];
    uint8_t txPayload[255];
  };

  struct BleQueuedCustomNotificationState {
    bool valid;
    uint8_t characteristicIndex;
    bool indication;
    uint8_t valueLength;
    uint8_t value[kCustomGattMaxValueLength];
  };

