lolren/nrf54-arduino-core/hardware/nrf54l15clean/nrf54l15clean/libraries/Nrf54L15-Clean-Implementation/src/nrf54l15_hal.h
  NRF_RADIO_Type* radio_;
  NRF_FICR_Type* ficr_;
  bool initialized_;
  BleAddressType addressType_;
  BleAdvPduType pduType_;
  bool useChSel2_;
  bool externalAntenna_;
  uint8_t address_[6];
  uint8_t advData_[kBleLegacyAdDataMaxLength];
  size_t advDataLen_;
  uint8_t extendedAdvData_[kBleExtendedAdvDataMaxLength];
  size_t extendedAdvDataLen_;
  uint8_t extendedScanRspData_[kBleExtendedAdvDataMaxLength];
  size_t extendedScanRspDataLen_;
  uint8_t extendedAdvSid_;
  uint16_t extendedAdvDid_;
  uint8_t extendedAdvAuxChannel_;
  uint8_t extendedSecondaryPacketCount_;
  uint8_t extendedScanRspPacketCount_;
  bool scanRspDataAutoDefault_;
  uint8_t scanRspData_[kBleLegacyAdDataMaxLength];
  size_t scanRspDataLen_;
  alignas(4) uint8_t txPacket_[2 + 251];
  alignas(4) uint8_t extendedPrimaryPacket_[2 + 255];
  alignas(4) uint8_t extendedAuxAdvPacket_[2 + 255];
  alignas(4) uint8_t extendedSecondaryPackets_[kBleExtendedSecondaryPacketCountMax][2 + 255];
  alignas(4) uint8_t extendedScanRspPackets_[kBleExtendedSecondaryPacketCountMax][2 + 255];
  alignas(4) uint8_t scanRspPacket_[2 + 6 + 31];
  alignas(4) uint8_t rxPacket_[2 + 255];
  alignas(4) uint8_t connectionTxPayload_[255];

  bool connected_;
  bool rfPathOwnedByBle_;
  bool backgroundAdvertisingRestoreRfPathValid_;
  bool backgroundAdvertisingRestoreRfPathPowerEnabled_;
  BoardAntennaPath backgroundAdvertisingRestoreRfPath_;
  BleConnectionRole connectionRole_;
  uint8_t connectionPeerAddress_[6];
  bool connectionPeerAddressRandom_;
  uint32_t connectionAccessAddress_;
  uint32_t connectionCrcInit_;
  uint16_t connectionIntervalUnits_;
  uint16_t connectionLatency_;
  uint16_t connectionTimeoutUnits_;
  uint8_t connectionChannelMap_[5];
  uint8_t connectionChannelCount_;
  uint8_t connectionHop_;
  bool connectionUseChSel2_;
  uint16_t connectionChannelId_;
  uint8_t connectionSca_;
  uint8_t connectionChanUse_;
  uint8_t connectionExpectedRxSn_;
  uint8_t connectionTxSn_;
  uint8_t connectionLastTxSn_;
  bool connectionTxHistoryValid_;
  bool connectionFreshTxAllowed_;
  uint16_t connectionEventCounter_;
  uint16_t connectionMissedEventCount_;
  uint32_t connectionNextEventUs_;
  uint32_t connectionFirstEventListenUs_;
  uint8_t connectionSyncAttemptsRemaining_;
  uint8_t connectionCurrentTxPhy_;
  uint8_t connectionCurrentRxPhy_;
  uint8_t connectionPreferredTxPhyMask_;
  uint8_t connectionPreferredRxPhyMask_;
  bool connectionPhyRequestPending_;
  bool connectionPhyRequestInFlight_;
  bool connectionPhyUpdatePending_;
  uint16_t connectionPhyUpdateInstant_;
  uint8_t connectionPendingTxPhy_;
  uint8_t connectionPendingRxPhy_;
  uint16_t connectionMaxTxPayloadLength_;
  uint16_t connectionMaxRxPayloadLength_;
  bool connectionDataLengthUpdatePending_;
  bool connectionDataLengthUpdateInFlight_;
  bool connectionDataLengthUpdateComplete_;
  bool connectionAttMtuExchangePending_;
  bool connectionAttMtuExchangeInFlight_;
  bool connectionAttMtuExchangeComplete_;
  bool connectionConnParamUpdatePending_;
  bool connectionConnParamUpdateInFlight_;
  uint8_t connectionConnParamUpdateIdentifier_;
  bool connectionCentralConnParamIndPending_;
  uint16_t connectionCentralConnParamIntervalUnits_;
  uint16_t connectionCentralConnParamLatency_;
  uint16_t connectionCentralConnParamTimeoutUnits_;
  uint16_t connectionRequestedAttMtu_;
  uint16_t connectionAttMtu_;
  uint32_t connectionCentralLinkSetupNotBeforeMs_;
  uint8_t connectionLastTxLlid_;
  uint8_t connectionLastTxLength_;
  // Snapshot of the last transmitted plaintext payload (before any encryption),
  // so callers can safely inspect `BleConnectionEvent::txPayload` even though
  // `connectionTxPayload_` is reused later in the connection event.
  uint8_t connectionLastTxPlainLlid_;
  uint8_t connectionLastTxPlainLength_;
  uint8_t connectionLastTxPlainPayload_[255];
  uint8_t connectionPendingTxLlid_;
  uint8_t connectionPendingTxLength_;
  bool connectionPendingTxValid_;
  uint8_t connectionPendingTxPayload_[255];
  bool connectionUpdatePending_;
  uint16_t connectionUpdateInstant_;
  uint8_t connectionPendingWinSize_;
  uint16_t connectionPendingWinOffset_;
  uint16_t connectionPendingIntervalUnits_;
  uint16_t connectionPendingLatency_;
  uint16_t connectionPendingTimeoutUnits_;
  bool connectionChannelMapPending_;
  uint16_t connectionChannelMapInstant_;
  uint8_t connectionPendingChannelMap_[5];
  uint8_t connectionPendingChannelCount_;
  bool connectionServiceChangedIndicationsEnabled_;
  bool connectionServiceChangedIndicationPending_;
  bool connectionServiceChangedIndicationAwaitingConfirm_;
  bool connectionBatteryNotificationsEnabled_;
  bool connectionBatteryNotificationPending_;
  bool connectionPreparedWriteActive_;
  uint16_t connectionPreparedWriteHandle_;
  uint8_t connectionPreparedWriteValue_[2];
  uint8_t connectionPreparedWriteMask_;
  static constexpr uint8_t kDeferredConnectionEventDepth = 8U;
  bool backgroundAdvertisingEnabled_;
  bool backgroundAdvertisingArmed_;
  bool backgroundAdvertisingInProgress_;
  bool backgroundAdvertisingDue_;
  bool backgroundAdvertisingThreeChannel_;
  bool backgroundAdvertisingRandomDelay_;
  bool backgroundAdvertisingManageRfPath_;
  bool backgroundAdvertisingRfPathCollapsed_;
  bool backgroundAdvertisingUseIrqTxKick_;
  bool backgroundAdvertisingManageLatency_;
  bool backgroundAdvertisingConstlatHardwareVerified_;
  bool backgroundAdvertisingAwaitingHfxoTuned_;
  BleAdvertisingChannel backgroundAdvertisingChannel_;
  uint32_t backgroundAdvertisingIntervalUs_;
  uint32_t backgroundAdvertisingInterChannelDelayUs_;
  uint32_t backgroundAdvertisingHfxoLeadUs_;
  uint32_t backgroundAdvertisingNextTxUs_;
  uint32_t backgroundAdvertisingServiceUs_;
  uint32_t backgroundAdvertisingEventStartTxUs_;
  uint32_t backgroundAdvertisingRandomState_;
  uint8_t backgroundAdvertisingPrimaryStage_;
  uint8_t backgroundAdvertisingLastStopReason_;
  uint8_t backgroundAdvertisingTxKickRetryCountCurrent_;
  uint8_t backgroundAdvertisingPendingTxCompareChannel_;
  uint8_t backgroundAdvertisingPendingServiceCompareChannel_;
  BleBackgroundAdvertisingDebugCounters backgroundAdvertisingDebug_;
  bool backgroundConnectionServiceEnabled_;
  bool backgroundConnectionServiceArmed_;
  bool backgroundConnectionServiceInProgress_;
  bool backgroundConnectionServiceDue_;
  bool backgroundConnectionRxPrepared_;
  uint8_t deferredConnectionEventHead_;
  uint8_t deferredConnectionEventTail_;
  uint8_t deferredConnectionEventCount_;
  uint8_t backgroundConnectionPreparedDataChannel_;
  uint32_t backgroundConnectionWakeUs_;
  uint8_t deferredConnectionPayload_[kDeferredConnectionEventDepth][255];
  uint8_t deferredConnectionTxPayload_[kDeferredConnectionEventDepth][255];
  uint8_t consumedDeferredConnectionPayload_[255];
  uint8_t consumedDeferredConnectionTxPayload_[255];
  BleConnectionEvent deferredConnectionEvents_[kDeferredConnectionEventDepth];
  BleDeferredGattWriteState deferredGattWrites_[4];
  const char* deferredTraces_[8];
  uint8_t deferredGattWriteHead_;
  uint8_t deferredGattWriteTail_;
  uint8_t deferredGattWriteCount_;
  uint8_t deferredTraceHead_;
  uint8_t deferredTraceTail_;
  uint8_t deferredTraceCount_;
  uint8_t lastDisconnectReason_;
  bool lastDisconnectReasonValid_;
  bool lastDisconnectReasonRemote_;
  uint8_t smpPairingState_;
  uint8_t smpPairingReq_[7];
  uint8_t smpPairingRsp_[7];
  uint8_t smpPeerConfirm_[16];
  uint8_t smpPeerRandom_[16];
  uint8_t smpLocalRandom_[16];
  bool smpPrefetchedLocalRandomValid_;
  uint8_t smpPrefetchedLocalRandom_[16];
  uint8_t smpLocalConfirm_[16];
  uint8_t smpStk_[16];
  bool smpStkValid_;
  bool connectionEncSessionValid_;
  bool connectionEncRxEnabled_;
  bool connectionEncTxEnabled_;
  bool connectionEncStartReqPending_;
  bool connectionEncStartReqTxPending_;
  bool connectionEncAwaitingStartRsp_;
  bool connectionEncEnableTxOnNextEvent_;
  uint64_t connectionEncRxCounter_;
  uint64_t connectionEncTxCounter_;
  bool connectionEncKeyDerivationPending_;
  uint8_t connectionEncSkd_[16];
  uint8_t connectionEncSessionKey_[16];
  uint8_t connectionEncSessionKeyAlt_[16];
  bool connectionEncAltKeyValid_;
  uint8_t connectionEncRxDirection_;
  uint8_t connectionEncTxDirection_;
  uint8_t connectionEncIv_[8];
  bool connectionPrefetchedEncMaterialValid_;
  uint8_t connectionPrefetchedSkds_[8];
  uint8_t connectionPrefetchedIvs_[4];
  bool connectionLastTxWasEncrypted_;
  uint8_t connectionLastTxEncryptedLength_;
  uint8_t connectionLastTxEncryptedPayload_[255];  // max DLE payload (251) + AES-CCM MIC (4)
  bool connectionEncPrecomputedEmptyValid_;
  uint64_t connectionEncPrecomputedCounter_;
  uint8_t connectionEncPrecomputedPayload_[4];
  bool connectionEncPrecomputedStartRspValid_;
  uint8_t connectionEncPrecomputedStartRsp_[1 + 4];
  bool connectionEncPrecomputedStartRspTxValid_;
  uint64_t connectionEncPrecomputedStartRspTxCounter_;
  uint8_t connectionEncPrecomputedStartRspTx_[1 + 4];
  BleBondLoadCallback bondLoadCallback_;
  BleBondSaveCallback bondSaveCallback_;
  BleBondClearCallback bondClearCallback_;
  void* bondCallbackContext_;
  BleBondRecord bondRecord_;
  bool bondRecordValid_;
  bool bondStorageLoaded_;
  bool bondKeyPrimedForConnection_;
  BleTraceCallback traceCallback_;
  void* traceCallbackContext_;
  bool smpBondingRequested_;
  bool smpExpectInitiatorEncKey_;
  bool smpExpectInitiatorIdKey_;
  bool smpPeerLtkValid_;
  bool smpPeerLtkAwaitMasterId_;
  bool smpPeerIrkValid_;
  bool smpPeerIdentityAddressValid_;
  bool smpPeerIdentityAddressRandom_;
  uint8_t smpPeerLtk_[16];
  uint8_t smpPeerIrk_[16];
  uint8_t smpPeerIdentityAddress_[6];
  uint8_t smpEncReqRand_[8];
  uint16_t smpEncReqEdiv_;
  uint8_t smpKeySize_;
  uint8_t advCycleStartIndex_;
  uint8_t scanCycleStartIndex_;
  uint8_t gapDeviceName_[31];
  uint8_t gapDeviceNameLen_;
  uint16_t gapAppearance_;
  uint16_t gapPpcpIntervalMin_;
  uint16_t gapPpcpIntervalMax_;
  uint16_t gapPpcpLatency_;
  uint16_t gapPpcpTimeout_;
  uint8_t gapBatteryLevel_;
  BleCustomServiceState customGattServices_[kCustomGattMaxServices];
  BleCustomCharacteristicState customGattCharacteristics_[kCustomGattMaxCharacteristics];
  BleCustomWriteHandlerState customGattWriteHandlers_[kCustomGattMaxCharacteristics];
  uint8_t customGattServiceCount_;
  uint8_t customGattCharacteristicCount_;
  uint16_t customGattNextHandle_;
  BleQueuedCustomNotificationState
      connectionCustomNotificationQueue_[kCustomGattNotificationQueueDepth];
  uint8_t connectionCustomNotificationQueueHead_;
  uint8_t connectionCustomNotificationQueueTail_;
  uint8_t connectionCustomNotificationQueueCount_;
  uint16_t connectionCustomIndicationAwaitingHandle_;
  bool connectionSmpSecurityRequestPending_;
  BleGattWriteCallback customGattWriteCallback_;
  void* customGattWriteContext_;
  BleEncryptionDebugCounters encDebug_;
  BleQueuedConnectionEvent queuedConnectionEvents_[kConnectionEventQueueDepth];
  uint8_t queuedConnectionEventPayloadScratch_[255];
  uint8_t queuedConnectionEventTxPayloadScratch_[255];
  uint8_t queuedConnectionEventHead_;
  uint8_t queuedConnectionEventTail_;
  uint8_t queuedConnectionEventCount_;
  int8_t latestConnectionRssiDbm_;
  bool latestConnectionRssiValid_;
  bool connectionServiceBusy_;
  BleDisconnectDebug disconnectDebug_;
  uint8_t lastObservedRxLlid_;
  uint8_t lastObservedRxLength_;
  uint8_t lastObservedRxOpcode_;
  uint8_t lastObservedRxNesn_;
  uint8_t lastObservedRxSn_;
  bool lastObservedPacketIsNew_;
  bool lastObservedPeerAckedLastTx_;
};

}  // namespace xiao_nrf54l15
